{
	"alias": "FEDORA-EPEL-2020-9d9cd4aeef",
	"autokarma": true,
	"autotime": true,
	"bugs": [
		{
			"bug_id": 1808197,
			"feedback": [
				{
					"bug_id": 1808197,
					"comment": {
						"id": 1266708,
						"karma": 1,
						"timestamp": "2020-03-05 15:27:39",
						"update_id": 190321,
						"user": {
							"avatar": "https://seccdn.libravatar.org/avatar/2cdb81dad1e4650242be03b42bd584834e470a31bac1900ee671e7703ad9457e?s=24&d=retro",
							"email": "Lam@Lam.pl",
							"groups": [
								{
									"name": "ipausers"
								},
								{
									"name": "fedora-contributor"
								},
								{
									"name": "signed_fpca"
								},
								{
									"name": "l10n"
								},
								{
									"name": "cvsl10n"
								}
							],
							"id": 3824,
							"name": "lam",
							"openid": "lam.id.fedoraproject.org"
						},
						"user_id": 3824
					},
					"comment_id": 1266708,
					"karma": 1
				},
				{
					"bug_id": 1808197,
					"comment": {
						"id": 1275298,
						"karma": 1,
						"text": "Works on RHEL 7 (EPEL 7)",
						"timestamp": "2020-03-11 10:26:02",
						"update_id": 190321,
						"user": {
							"avatar": "https://seccdn.libravatar.org/avatar/7f4f63d0a99a8fd83f564f68762eedad27f53b24a95decbbb2978ae6a116b44a?s=24&d=retro",
							"email": "lee.jnk@gmail.com",
							"id": 5069,
							"name": "leejnk",
							"openid": "leejnk.id.fedoraproject.org"
						},
						"user_id": 5069
					},
					"comment_id": 1275298,
					"karma": 1
				},
				{
					"bug_id": 1808197,
					"comment": {
						"id": 1295603,
						"karma": 1,
						"text": "Working on CentOS 8.1 and RHEL 8.1\n\nthanks.",
						"timestamp": "2020-03-26 11:04:11",
						"update_id": 195295,
						"user": {
							"avatar": "https://seccdn.libravatar.org/avatar/7f4f63d0a99a8fd83f564f68762eedad27f53b24a95decbbb2978ae6a116b44a?s=24&d=retro",
							"email": "lee.jnk@gmail.com",
							"id": 5069,
							"name": "leejnk",
							"openid": "leejnk.id.fedoraproject.org"
						},
						"user_id": 5069
					},
					"comment_id": 1295603
				},
				{
					"bug_id": 1808197,
					"comment": {
						"id": 1297180,
						"karma": 1,
						"text": "Working in RHEL 7.\n\nthanks.",
						"timestamp": "2020-03-27 10:07:47",
						"update_id": 194269,
						"user": {
							"avatar": "https://seccdn.libravatar.org/avatar/7f4f63d0a99a8fd83f564f68762eedad27f53b24a95decbbb2978ae6a116b44a?s=24&d=retro",
							"email": "lee.jnk@gmail.com",
							"id": 5069,
							"name": "leejnk",
							"openid": "leejnk.id.fedoraproject.org"
						},
						"user_id": 5069
					},
					"comment_id": 1297180,
					"karma": 1
				}
			],
			"title": "seamonkey-2.53.1.source is available",
			"bugzilla": {
				"bug_id": "1808197",
				"creation_ts": "2020-02-28 05:06:36 +0000",
				"short_desc": "seamonkey-2.53.1.source is available",
				"delta_ts": "2020-03-28 00:44:43 +0000",
				"bug_status": "CLOSED",
				"resolution": "ERRATA",
				"keywords": "FutureFeature, Triaged",
				"priority": "unspecified",
				"bug_severity": "unspecified",
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "13653943",
						"comment_count": "0",
						"who": {
							"text": "upstream-release-monitoring",
							"name": "Upstream Release Monitoring"
						},
						"bug_when": "2020-02-28 05:06:36 +0000",
						"thetext": "Latest upstream release: 2.53.1.source\nCurrent version/release in rawhide: 2.49.5-4.fc32\nURL: http://www.seamonkey-project.org\n\nPlease consult the package updates policy before you issue an update to a stable branch: https://fedoraproject.org/wiki/Updates_Policy\n\n\nMore information about the service that created this bug can be found at: https://fedoraproject.org/wiki/Upstream_release_monitoring\n\n\nPlease keep in mind that with any upstream change, there may also be packaging changes that need to be made. Specifically, please remember that it is your responsibility to review the new version to ensure that the licensing is still correct and that no non-free or legally problematic items have been added upstream.\n\n\nBased on the information from anitya: https://release-monitoring.org/project/4788/"
					},
					{
						"isprivate": "0",
						"commentid": "13653944",
						"comment_count": "1",
						"who": {
							"text": "upstream-release-monitoring",
							"name": "Upstream Release Monitoring"
						},
						"bug_when": "2020-02-28 05:06:45 +0000",
						"thetext": "The following Sources of the specfile are not valid URLs so we cannot automatically build the new version for you.  Please use URLs in your Source declarations if possible.\n\n- seamonkey-find-requires.sh\n- seamonkey-mail.desktop\n- seamonkey-mail.svg\n- seamonkey.sh.in\n- seamonkey.desktop"
					},
					{
						"isprivate": "0",
						"commentid": "13663078",
						"comment_count": "2",
						"who": {
							"text": "lam",
							"name": "Leszek Matok"
						},
						"bug_when": "2020-03-02 19:21:22 +0000",
						"thetext": "Dmitry,\n\nI have installed seamonkey-2.53.1-1.fc31.x86_64.rpm straight from Koji, I can't believe how much faster it is compared to 2.49.5! Apart from GreaseMonkey not working (gmport will need an update, I guess) and crashing when using CookieKeeper (I will need to learn systemd-coredump to get backtrace), my only other issue is with the GTK3 port.\n\nYou see, I can't see the scroll bars on web pages, on my GTK3 theme on the vertical bar it's just a grey area, no button on it. If you get the horizontal one, there's a sliding rectangle because the background is different (so the horizontal one is at least functional). I checked other GTK3 themes and usually both scrollbars have some kind of a rectangle, but there's still a color difference between vertical and horizontal scrollbar, and if the rectangles have a border (which makes them visible even if the color is the same), that border's thickness depends on how much zoom you apply to the page/tab!\n\nCan we have at least this thing reversed to the theme's scollbars, like the GTK2 patches used to do? Please :)\n\n(Or just bring those back, GTK2 SeaMonkey was awesome and tabs looked like tabs ;))\n\nAlso, I've tried looking for where this is defined, but the only mentions of scrollbars in suite/themes/classic/ are under communicator/scrollbars.css, but that doesn't look like it's being used here (it has non-theme colors, it has button changing color on mouse hover etc., clearly this is being overridden or doesn't apply to the browser). I wish I knew where to look to tinker with it and propose a patch, but I'm clueless, this project is really overwhelming when looking at it for the first time."
					},
					{
						"isprivate": "0",
						"commentid": "13663216",
						"comment_count": "3",
						"who": {
							"text": "dmitry",
							"name": "Dmitry Butskoy"
						},
						"bug_when": "2020-03-02 20:03:02 +0000",
						"thetext": "(In reply to Leszek Matok from comment #2)\n> GreaseMonkey not working (gmport will need an update, I guess) and crashing\n> when using CookieKeeper\n\nProbably you need to install some new versions, intended to work with SM-2.53+ (or FF56+). Please, report if this will not help, to report issues upstream.\n\n> my only other issue is with the GTK3 port.\n> \n> You see, I can't see the scroll bars on web pages, on my GTK3 theme on the\n> vertical bar it's just a grey area, no button on it. If you get the\n> horizontal one, there's a sliding rectangle because the background is\n> different (so the horizontal one is at least functional). I checked other\n> GTK3 themes and usually both scrollbars have some kind of a rectangle, but\n> there's still a color difference between vertical and horizontal scrollbar,\n> and if the rectangles have a border (which makes them visible even if the\n> color is the same), that border's thickness depends on how much zoom you\n> apply to the page/tab!\n\nDo you mean that you don't use \"standard\" Classic or Modern theme, and the themes you use depend on the GTK3 theme chosen?\n\n> Can we have at least this thing reversed to the theme's scollbars, like the\n> GTK2 patches used to do? Please :)\n\nHmm, what patches are you talking about? (That was in 2.49.5 rpm?)\n\n> (Or just bring those back, GTK2 SeaMonkey was awesome and tabs looked like\n> tabs ;))\n\nSorry, GTK2 died here.\n\n> I wish I knew where to look to\n> tinker with it and propose a patch, but I'm clueless, this project is really\n> overwhelming when looking at it for the first time.\n\nFirst of all, what happens on a clean profile?\n\nCould you provide here an url to problem SM theme(s) you are tested, accompanied with the correspond gtk3 themes' list? Then I and/or upstream could try to reproduce.\n\nThe new SM-2.53 release accompanies a lot of changes. That way the issues with non-standard theme usage are expected. Let's try to fix them."
					},
					{
						"isprivate": "0",
						"commentid": "13663410",
						"comment_count": "4",
						"who": {
							"text": "dmitry",
							"name": "Dmitry Butskoy"
						},
						"bug_when": "2020-03-02 21:20:49 +0000",
						"thetext": "From https://www.seamonkey-project.org/releases/seamonkey2.53.1/\n\n> Full theme add-ons may need changes because of user interface and internal changes.\n> If you find any problem with themes, contact the theme author. Before reporting\n> a problem with the user interface please make sure to recreate it with either\n> the Classic or Modern theme.\n\nIf it is the case, then:\n> I wish I knew where to look to\n> tinker with it and propose a patch, but I'm clueless, this project is really\n> overwhelming when looking at it for the first time.\n\nTry to consider the changes in, say, Modern theme from 2.49.5 (or even 2.49.1) to 2.53.1, and then apply such changes to your specific theme."
					},
					{
						"isprivate": "0",
						"commentid": "13663421",
						"comment_count": "5",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-02 21:27:51 +0000",
						"thetext": "FEDORA-EPEL-2020-9d9cd4aeef has been submitted as an update to Fedora EPEL 7. https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-9d9cd4aeef"
					},
					{
						"isprivate": "0",
						"commentid": "13663422",
						"comment_count": "6",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-02 21:29:57 +0000",
						"thetext": "FEDORA-2020-fbc034e6c3 has been submitted as an update to Fedora 32. https://bodhi.fedoraproject.org/updates/FEDORA-2020-fbc034e6c3"
					},
					{
						"isprivate": "0",
						"commentid": "13663428",
						"comment_count": "7",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-02 21:36:14 +0000",
						"thetext": "FEDORA-2020-fea1a7fde2 has been submitted as an update to Fedora 30. https://bodhi.fedoraproject.org/updates/FEDORA-2020-fea1a7fde2"
					},
					{
						"isprivate": "0",
						"commentid": "13663467",
						"comment_count": "8",
						"who": {
							"text": "pmarciniak",
							"name": "Paweł"
						},
						"bug_when": "2020-03-02 21:59:15 +0000",
						"thetext": "I have tried to compile srpm by myself (F31, rpmbuild command) but it failed with an error\n\nconfigure: error: installation or configuration problem: C compiler cannot create executables.\n...\nDEBUG: /usr/bin/ld: cannot find -lgcc_s\n\nMissing lib is in /usr/lib/gcc/x86_64-redhat-linux/9/libgcc_s.so (it comes from gcc package)\n\nWhere is /usr/lib64/libgcc_s.so.1 from libgcc\n\nThe same problem with stdc++"
					},
					{
						"isprivate": "0",
						"commentid": "13663493",
						"comment_count": "9",
						"who": {
							"text": "lam",
							"name": "Leszek Matok"
						},
						"bug_when": "2020-03-02 22:06:54 +0000",
						"thetext": "(In reply to Dmitry Butskoy from comment #3)\n\n> Probably you need to install some new versions, intended to work with\n> SM-2.53+ (or FF56+).\nYes, GreaseMonkey will surely need a new version, but the other one actually crashes the browser, an extension shouldn't be able to do that (as opposed to plugins). But forget about those, I only mentioned them as a confirmation that even for a hardcore SM user like myself, everything works with only minor annoyances, so a really, really good release, other than the scrollbar issue :)\n\n> Do you mean that you don't use \"standard\" Classic or Modern theme, and the\n> themes you use depend on the GTK3 theme chosen?\nIt's all SeaMonkey Classic theme (I even said I was looking under suite/themes/classic, but didn't make it clear, sorry). Yes, the theme tries to use \"system\" colors from the GTK3 theme in some way. The scrollbars are different when switching between GTK3 themes, but no matter which GTK3 theme I test: 1. there's no actual scrollbar button from the GTK3 theme, just a plain rectangle between the GTK3 theme's actual arrow buttons, 2. in dark themes the rectangle is invisible on the vertical bar and 3. All themes have a color difference between the vertical (more broken) and horizontal (less broken) scrollbar.\n\n> Hmm, what patches are you talking about? (That was in 2.49.5 rpm?)\nYes, the ones from 2.49.5 and earlier - those used to revert scrollbars to actual GTK (2 in that case), as far as I understand. Would be sweet to just get that part back for GTK3 version. I think a big part of SeaMonkey users are \"conservative\" people that want their browsers to behave and look like all other applications in the system, so this wouldn't be controversial to anyone interested.\n\n> First of all, what happens on a clean profile?\nClean profile (I just ran from another user, rm -rf .mozilla; seamonkey) is exactly the same. Start page has vertical scrollbar that's invisible on dark themes, opening something that has horizontal scrollbar (like an image) shows the horizontal scrollbar has different colors.\n\n> Could you provide here an url to problem SM theme(s) you are tested,\n> accompanied with the correspond gtk3 themes' list? Then I and/or upstream\n> could try to reproduce.\nMy GTK3 theme is my own - https://github.com/Lamieur/Darklooks/ but you don't need to play with it - ALL dark themes give similar experience. I checked like 15 other themes that I have installed (several Mint-*, Unity, Traditional-OK-Test, DeLorean, Smoothly-Black - basically gnome-themes-extras + mate-theme-extras). Lighter skins usually have black border around the rectangle (button), so you can tell where it is, even if it's the same color as the background. For dark themes, even if they technically have a border (like Mint-Y-Dark, BlackMATE, DeLorean Dark, Adapta-Nokto-Eta from adapta-gtk-theme), it's invisible to my eyes / on my display.\n\nAnd have I mentioned the issue where switching to a tab with a 240% zoomed page makes the scrollbars huge? :) (If I wanted huge UI elements, there's a DPI system setting. Zooming the page is just that - you don't get huge scrollbars when zooming in in Evince/Atril/etc. - that's baseline UX)\n\nThanks for your consideration."
					},
					{
						"isprivate": "0",
						"commentid": "13663542",
						"comment_count": "10",
						"who": {
							"text": "lam",
							"name": "Leszek Matok"
						},
						"bug_when": "2020-03-02 22:24:05 +0000",
						"thetext": "And for free giggles:\n\nDouble-click to select: https://www.youtube.com/watch?v=dQw4w9WgXcQ\n\nNow middle-click on a tab that you want to close.\n\nThis will in fact close that tab. BUT the active tab (or last active tab if you middle-click on the currently active tab) opens the url.\n\nRickrolling is always funny, until you lose a form you've been filling out for the last half hour ;)"
					},
					{
						"isprivate": "0",
						"commentid": "13663708",
						"comment_count": "11",
						"who": {
							"text": "dmitry",
							"name": "Dmitry Butskoy"
						},
						"bug_when": "2020-03-03 00:03:31 +0000",
						"thetext": "(In reply to Paweł from comment #8)\n> I have tried to compile srpm by myself (F31, rpmbuild command) but it failed\n> with an error\nSome local misconfiguraton. Email me directly output of your rpmbuild (both stdout and stderr together), I'll try guess the reason."
					},
					{
						"isprivate": "0",
						"commentid": "13663752",
						"comment_count": "12",
						"who": {
							"text": "dmitry",
							"name": "Dmitry Butskoy"
						},
						"bug_when": "2020-03-03 00:41:10 +0000",
						"thetext": "(In reply to Leszek Matok from comment #9)\n> 1. there's no actual scrollbar button from the GTK3 theme, just a\n> plain rectangle between the GTK3 theme's actual arrow buttons\n\nYep. Kinda \"no bug, just a feature\" :)\n\nIt seems that after trying to provide scrollbar top/bottom buttons in bug #1269145, such a rectangle has appeared.\n\n> 2. in dark themes the rectangle is invisible on the vertical bar\n\nNope for me, just \"hard to see\" (on CentOS-7). Since there is no proper button.\n\n> 3. All themes have a color difference between the vertical (more broken) and\n> horizontal (less broken) scrollbar.\n\nCannot reproduce (under CentOS-7). Just different sizes on some themes, but colors are the same.\n\n> Yes, the ones from 2.49.5 and earlier - those used to revert scrollbars to\n> actual GTK (2 in that case), as far as I understand. Would be sweet to just\n> get that part back for GTK3 version.\n\nThen we lose scrollbar top/bottom buttons...\n\n> \n> And have I mentioned the issue where switching to a tab with a 240% zoomed\n> page makes the scrollbars huge? :)\n\nWhat theme? If some standard (not third party), then could you provide a proper test case (on a clean profile, theme name, and detailed steps to reproduce).\n\n> Double-click to select: https://www.youtube.com/watch?v=dQw4w9WgXcQ\n>\n> Now middle-click on a tab that you want to close.\n>\n> This will in fact close that tab. BUT the active tab (or last active tab if you\n> middle-click on the currently active tab) opens the url.\n\nIs it somehow youtube-related? Anyway, a detailed test case could be fine."
					},
					{
						"isprivate": "0",
						"commentid": "13663974",
						"comment_count": "13",
						"who": {
							"text": "dmitry",
							"name": "Dmitry Butskoy"
						},
						"bug_when": "2020-03-03 04:07:14 +0000",
						"thetext": "Leszek,\n\nCould you please test the rectangle issues with new package:\nhttps://koji.fedoraproject.org/koji/taskinfo?taskID=42121873\nhttps://kojipkgs.fedoraproject.org//work/tasks/1873/42121873/seamonkey-2.53.1-1.fc31.1.x86_64.rpm\n\nIt looks like something was changed since 2.49.5 time, and the problem gtk3 patch no more needed.\n\nInterested as much themes as possible. (Note, that some themes might not have scrollbar top/bottom buttons by design -- in such a case it is not an SM issue, when all the desktop applications behave the same way)."
					},
					{
						"isprivate": "0",
						"commentid": "13664802",
						"comment_count": "14",
						"who": {
							"text": "lam",
							"name": "Leszek Matok"
						},
						"bug_when": "2020-03-03 09:49:56 +0000",
						"thetext": "(In reply to Dmitry Butskoy from comment #13)\n\n> Could you please test the rectangle issues with new package:\n\nYes, this helps tremendously, for all the themes I've tested! There are now decorations similar to those of the theme [1] (buttons, rounded sliders etc., not just a blank rectangle) and vertical and horizontal bars are now the same. I'm happy.\n\n(I found two GTK3 themes that had a different issue when zooming, but that can be blamed on particular GTK3 theme itself since all others work as expected now.)\n\nThanks for your effort, you have no idea how much this helps :)\n\n[1] Similar, not identical, but this is probably workable on the theme level (scaling/sizing of decorations and such, I will tinker with my theme to see if I can make it perfect). I'm already happy!\n\n\n> Is it somehow youtube-related? Anyway, a detailed test case could be fine.\n\nNot specific to any webpage, that was just a rickroll attempt (destroyed by Bugzilla's auto-linker, but you can double-click on the right of the link to select it as text). The point was to have any full URL selected with the mouse, then middle-clicking a tab.\n\nIn SeaMonkey 2.53.1, middle-click on the tab closes it. But it seemingly doesn't stop the middle-click signal, which still hits the next tab to become active. If you have a full URL copied in PRIMARY, middle-click on one tab closes this tab, but then... opens the URL in the next active tab (or current tab if you're closing another tab).\n\nAs you remember, some time ago middle-clicking in the page was changed so it requires full URL (with http:// or https://) to work as \"paste and go\" from the PRIMARY selection (clipboard). This limited misclicks with garbage in the buffer, and now drastically lowers this bug's severity."
					},
					{
						"isprivate": "0",
						"commentid": "13666415",
						"comment_count": "15",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-03 16:10:13 +0000",
						"thetext": "seamonkey-2.53.1-1.fc32 has been pushed to the Fedora 32 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-2020-fbc034e6c3"
					},
					{
						"isprivate": "0",
						"commentid": "13667158",
						"comment_count": "16",
						"who": {
							"text": "lam",
							"name": "Leszek Matok"
						},
						"bug_when": "2020-03-03 16:37:55 +0000",
						"thetext": "Ha, actually that one is not just a regression, but a comeback of a... 19 year old bug! https://bugzilla.mozilla.org/show_bug.cgi?id=107147 - back then the solution was to disable middle-click tab closing with middlemouse.contentLoadURL set [1] - even though people argued it should mean close regardless (and I tend to agree).\n\nI wasn't able to find a newer manifestation of this bug in bugzilla, so I don't know if this change (to bring back middle-click to close tab) was an upstream change but still unreported, or is this part of Fedora patches. Either way it's nice, just a small bug left in the implementation.\n\n[1] still the default for a new profile - which I fully approve of course :)"
					},
					{
						"isprivate": "0",
						"commentid": "13668030",
						"comment_count": "17",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-03 20:46:35 +0000",
						"thetext": "seamonkey-2.53.1-1.fc30 has been pushed to the Fedora 30 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-2020-fea1a7fde2"
					},
					{
						"isprivate": "0",
						"commentid": "13668069",
						"comment_count": "18",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-03 20:58:28 +0000",
						"thetext": "seamonkey-2.53.1-1.el7 has been pushed to the Fedora EPEL 7 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-9d9cd4aeef"
					},
					{
						"isprivate": "0",
						"commentid": "13668098",
						"comment_count": "19",
						"who": {
							"text": "dmitry",
							"name": "Dmitry Butskoy"
						},
						"bug_when": "2020-03-03 21:08:20 +0000",
						"thetext": "(In reply to Leszek Matok from comment #14)\n> In SeaMonkey 2.53.1, middle-click on the tab closes it. But it seemingly\n> doesn't stop the middle-click signal, which still hits the next tab to\n> become active. If you have a full URL copied in PRIMARY, middle-click on one\n> tab closes this tab, but then... opens the URL in the next active tab (or\n> current tab if you're closing another tab).\n\nNo any specific changes seen for such a behaviour. Looks like side effect of the changes in another parts of the code.\n\nCurrently, Firefox just set \"middlemouse.contentLoadURL\" to false since FF-57 (after a years long discussion in its bug 366945). For FF-56 based SM-2.53, the old prefs is still there. Probably setting the prefs to false looks like a reasonable solution.\n\nThere is some related SM bug https://bugzilla.mozilla.org/show_bug.cgi?id=1558596 , it is initially for SM-2.57, but the change is ported to 2.53 now.\n\nYou can discuss there further."
					},
					{
						"isprivate": "0",
						"commentid": "13668527",
						"comment_count": "20",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-04 01:48:16 +0000",
						"thetext": "FEDORA-EPEL-2020-4fdca9429c has been submitted as an update to Fedora EPEL 7. https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-4fdca9429c"
					},
					{
						"isprivate": "0",
						"commentid": "13672199",
						"comment_count": "21",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-04 20:14:45 +0000",
						"thetext": "seamonkey-2.53.1-2.fc32 has been pushed to the Fedora 32 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-2020-5e09dc8487"
					},
					{
						"isprivate": "0",
						"commentid": "13672514",
						"comment_count": "22",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-04 21:50:50 +0000",
						"thetext": "seamonkey-2.53.1-2.el7 has been pushed to the Fedora EPEL 7 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-4fdca9429c"
					},
					{
						"isprivate": "0",
						"commentid": "13672606",
						"comment_count": "23",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-04 22:26:40 +0000",
						"thetext": "seamonkey-2.53.1-2.fc30 has been pushed to the Fedora 30 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-2020-b00f3fbb69"
					},
					{
						"isprivate": "0",
						"commentid": "13699338",
						"comment_count": "24",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-12 22:25:51 +0000",
						"thetext": "seamonkey-2.53.1-2.el8 has been pushed to the Fedora EPEL 8 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-f4d5eaa149"
					},
					{
						"isprivate": "0",
						"commentid": "13699689",
						"comment_count": "25",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-13 02:30:13 +0000",
						"thetext": "seamonkey-2.53.1-2.fc30 has been pushed to the Fedora 30 stable repository. If problems still persist, please make note of it in this bug report."
					},
					{
						"isprivate": "0",
						"commentid": "13707866",
						"comment_count": "26",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-16 20:21:33 +0000",
						"thetext": "seamonkey-2.53.1-2.fc32 has been pushed to the Fedora 32 stable repository. If problems still persist, please make note of it in this bug report."
					},
					{
						"isprivate": "0",
						"commentid": "13708112",
						"comment_count": "27",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-16 20:32:49 +0000",
						"thetext": "seamonkey-2.53.1-2.fc32 has been pushed to the Fedora 32 stable repository. If problems still persist, please make note of it in this bug report."
					},
					{
						"isprivate": "0",
						"commentid": "13724867",
						"comment_count": "28",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-21 12:43:52 +0000",
						"thetext": "FEDORA-EPEL-2020-c513b3c1ca has been submitted as an update to Fedora EPEL 7. https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-c513b3c1ca"
					},
					{
						"isprivate": "0",
						"commentid": "13724871",
						"comment_count": "29",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-21 12:47:29 +0000",
						"thetext": "FEDORA-EPEL-2020-722463ecb6 has been submitted as an update to Fedora EPEL 8. https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-722463ecb6"
					},
					{
						"isprivate": "0",
						"commentid": "13725385",
						"comment_count": "30",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-22 00:26:37 +0000",
						"thetext": "seamonkey-2.53.1-3.el7 has been pushed to the Fedora EPEL 7 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-c513b3c1ca"
					},
					{
						"isprivate": "0",
						"commentid": "13725524",
						"comment_count": "31",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-22 03:57:43 +0000",
						"thetext": "seamonkey-2.53.1-3.el8 has been pushed to the Fedora EPEL 8 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-722463ecb6"
					},
					{
						"isprivate": "0",
						"commentid": "13739320",
						"comment_count": "32",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-26 01:29:12 +0000",
						"thetext": "FEDORA-EPEL-2020-3041108f43 has been pushed to the Fedora EPEL 8 testing repository.\n\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-3041108f43\n\nSee also https://fedoraproject.org/wiki/QA:Updates_Testing for more information on how to test updates."
					},
					{
						"isprivate": "0",
						"commentid": "13745102",
						"comment_count": "33",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-27 13:22:25 +0000",
						"thetext": "FEDORA-EPEL-2020-3041108f43 has been pushed to the Fedora EPEL 8 stable repository.\nIf problem still persists, please make note of it in this bug report."
					},
					{
						"isprivate": "0",
						"commentid": "13747301",
						"comment_count": "34",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2020-03-28 00:44:43 +0000",
						"thetext": "FEDORA-EPEL-2020-c513b3c1ca has been pushed to the Fedora EPEL 7 stable repository.\nIf problem still persists, please make note of it in this bug report."
					}
				]
			}
		}
	],
	"builds": [
		{
			"epoch": 0,
			"nvr": "seamonkey-2.53.1-1.el7",
			"release_id": 8,
			"signed": true,
			"type": "rpm",
			"package": {
				"src": [
					{
						"name": "seamonkey",
						"version": "2.53.1",
						"release": "1.el7",
						"arch": "src"
					}
				],
				"x86_64": [
					{
						"name": "seamonkey",
						"version": "2.53.1",
						"release": "1.el7",
						"arch": "x86_64"
					},
					{
						"name": "seamonkey-debuginfo",
						"version": "2.53.1",
						"release": "1.el7",
						"arch": "x86_64"
					}
				]
			}
		}
	],
	"close_bugs": true,
	"comments": [
		{
			"id": 1262608,
			"text": "This update has been submitted for testing by buc. ",
			"timestamp": "2020-03-02 21:27:48",
			"update_id": 189930,
			"user": {
				"avatar": "https://apps.fedoraproject.org/img/icons/bodhi-24.png",
				"id": 91,
				"name": "bodhi",
				"openid": "bodhi.id.fedoraproject.org"
			},
			"user_id": 91
		},
		{
			"id": 1262609,
			"text": "This update's test gating status has been changed to 'waiting'.",
			"timestamp": "2020-03-02 21:27:48",
			"update_id": 189930,
			"user": {
				"avatar": "https://apps.fedoraproject.org/img/icons/bodhi-24.png",
				"id": 91,
				"name": "bodhi",
				"openid": "bodhi.id.fedoraproject.org"
			},
			"user_id": 91
		},
		{
			"id": 1262610,
			"text": "This update's test gating status has been changed to 'ignored'.",
			"timestamp": "2020-03-02 21:27:52",
			"update_id": 189930,
			"user": {
				"avatar": "https://apps.fedoraproject.org/img/icons/bodhi-24.png",
				"id": 91,
				"name": "bodhi",
				"openid": "bodhi.id.fedoraproject.org"
			},
			"user_id": 91
		},
		{
			"id": 1264264,
			"text": "This update has been pushed to testing.",
			"timestamp": "2020-03-03 20:58:31",
			"update_id": 189930,
			"user": {
				"avatar": "https://apps.fedoraproject.org/img/icons/bodhi-24.png",
				"id": 91,
				"name": "bodhi",
				"openid": "bodhi.id.fedoraproject.org"
			},
			"user_id": 91
		},
		{
			"id": 1264601,
			"text": "This update has been obsoleted by [seamonkey-2.53.1-2.el7](https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-4fdca9429c).",
			"timestamp": "2020-03-04 01:48:13",
			"update_id": 189930,
			"user": {
				"avatar": "https://apps.fedoraproject.org/img/icons/bodhi-24.png",
				"id": 91,
				"name": "bodhi",
				"openid": "bodhi.id.fedoraproject.org"
			},
			"user_id": 91
		}
	],
	"content_type": "rpm",
	"date_pushed": "2020-03-03 20:58:17",
	"date_submitted": "2020-03-02 21:27:47",
	"date_testing": "2020-03-03 20:58:17",
	"meets_testing_requirements": true,
	"notes": "Upgrade to 2.53.1\n\nSeaMonkey-2.53.1, being initially based on the Firefox-56 and Thunderbird-56 code, incorporates now a lot of backported features and security fixes from the newer Firefox/Thunderbird versions up to 75. That way it tries to be a modern browser, preserving the same time the familiar user interface and the ability to use traditional extensions and addons.\n\nThis version makes changes to your profile that can't be reverted in case you want to go back to a previous version of SeaMonkey. You MUST absolutely do a full backup of your profile (~/.mozilla/seamonkey/ dir) BEFORE trying to run new version.\n\nSeaMonkey now uses GTK3 library for GUI interface. If you experienced some size issues, go to \"about:config\" and try to set \"layout.css.devPixelsPerPx\" parameter to \"1\" (or any other preferred value). You can also use gtk3's environment variables GDK_SCALE and/or GDK_DPI_SCALE (useful for HiDPI displays).\n\nFull theme add-ons may need changes because of user interface and internal changes. If you find any problem with themes, contact the theme author. Before reporting a problem with the user interface, please make sure to recreate it with either the Classic or Modern theme.\n\nThis version now includes \"Lightning\" calendar. It becomes a standard part of Thunderbird/SeaMonkey, being just technically organized as an extension.\nThis version returns providing of Chatzilla and DOM inspector extensions, just as it always was before.\n\nIt is likely you need to update your third party extensions to newer versions. Poorly designed or incompatible extensions can cause unpredictable problems. If you encounter some strange issues, try \"seamonkey -safe-mode\" from command line.\n\nUnfortunately, it is now impossible to continue support of npapi plugins. Thus, java applets no more work :( . All modern browsers have dropped such support years ago, and even plugin owners recommend to not use it anymore. Search \"browsers with java support\" if you still need it. Sorry for that.\nFlash is still supported, at least until its EOL at the end of 2020.\n\nSince 2.53.1, 32-bit version (i686 arch) does not provided, since no more supported.\n\nPlease, read upstream release notes for more info https://www.seamonkey-project.org/releases/seamonkey2.53.1/",
	"release": {
		"branch": "epel7",
		"candidate_tag": "epel7-testing-candidate",
		"composed_by_bodhi": true,
		"create_automatic_updates": false,
		"dist_tag": "epel7",
		"id_prefix": "FEDORA-EPEL",
		"long_name": "Fedora EPEL 7",
		"mail_template": "fedora_epel_legacy_errata_template",
		"name": "EPEL-7",
		"override_tag": "epel7-override",
		"package_manager": "unspecified",
		"pending_signing_tag": "epel7-signing-pending",
		"pending_stable_tag": "epel7-pending",
		"pending_testing_tag": "epel7-testing-pending",
		"stable_tag": "epel7",
		"state": "archived",
		"testing_tag": "epel7-testing",
		"version": "7"
	},
	"require_bugs": true,
	"severity": "high",
	"stable_days": 14,
	"stable_karma": 3,
	"status": "obsolete",
	"suggest": "unspecified",
	"test_gating_status": "ignored",
	"title": "seamonkey-2.53.1-1.el7",
	"type": "security",
	"url": "https://bodhi.fedoraproject.org/updates/FEDORA-EPEL-2020-9d9cd4aeef",
	"unstable_karma": -3,
	"updateid": "FEDORA-EPEL-2020-9d9cd4aeef",
	"user": {
		"avatar": "https://seccdn.libravatar.org/avatar/da7932d406cbdab1f44bf5322e0208c5cb47bb2a1a73d6e39a00f1f406922504?s=24&d=retro",
		"email": "dmitry@butskoy.name",
		"groups": [
			{
				"name": "packager"
			},
			{
				"name": "ipausers"
			},
			{
				"name": "fedora-contributor"
			},
			{
				"name": "signed_fpca"
			},
			{
				"name": "fedorabugs"
			}
		],
		"id": 316,
		"name": "buc",
		"openid": "buc.id.fedoraproject.org"
	},
	"version_hash": "33bcb52426d4257c841c4fef2c296d0e42c942c8"
}
