{
	"alias": "FEDORA-2017-c3149b5fcb",
	"autokarma": true,
	"bugs": [
		{
			"bug_id": 1458870,
			"parent": true,
			"security": true,
			"title": "CVE-2017-10911 xsa216 xen: blkif responses leak backend stack data (XSA-216)",
			"bugzilla": {
				"bug_id": "1458870",
				"alias": "xsa216",
				"creation_ts": "2017-06-05 17:42:49 +0000",
				"short_desc": "CVE-2017-10911 xsa216 xen: blkif responses leak backend stack data (XSA-216)",
				"delta_ts": "2021-06-10 12:24:21 +0000",
				"bug_status": "CLOSED",
				"resolution": "ERRATA",
				"keywords": "Security",
				"priority": "low",
				"bug_severity": "low",
				"depends_on": [
					"1463247"
				],
				"blocked": [
					{
						"bug_id": "1458881",
						"error": "NotPermitted"
					}
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10478255",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-05 17:42:49 +0000",
						"thetext": "ISSUE DESCRIPTION\n=================\n\nThe block interface response structure has some discontiguous fields.\nCertain backends populate the structure fields of an otherwise\nuninitialized instance of this structure on their stacks, leaking\ndata through the (internal or trailing) padding field.\n\nIMPACT\n======\n\nA malicious unprivileged guest may be able to obtain sensitive\ninformation from the host or other guests.\n\nVULNERABLE SYSTEMS\n==================\n\nAll Linux versions supporting the xen-blkback, blkback, or blktap\ndrivers are vulnerable.\n\nFreeBSD, NetBSD and Windows (with our without PV drivers) are not\nvulnerable (either because they do not have backends at all, or\nbecause they use a different implementation technique which does not\nsuffer from this problem).\n\nAll qemu versions supporting the Xen block backend are vulnerable.  The\nqemu-xen-traditional code base does not include such code, so is not\nvulnerable.  Note that an instance of qemu will be spawned to provide\nthe backend for most non-raw-format disks; so you may need to apply the\npatch to qemu even if you use only PV guests.\n\nMITIGATION\n==========\n\nThere's no mitigation available for x86 PV and ARM guests.\n\nFor x86 HVM guests it may be possible to change the guest\nconfiguaration such that a fully virtualized disk is being made\navailable instead.  However, this would normally entail changes inside\nthe guest itself.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-216.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Anthony Perard (Citrix)"
					},
					{
						"isprivate": "0",
						"commentid": "10522998",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:34:26 +0000",
						"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
					}
				]
			}
		},
		{
			"bug_id": 1458871,
			"parent": true,
			"security": true,
			"title": "CVE-2017-10912 xsa217 xen: page transfer may allow PV guest to elevate privilege (XSA-217)",
			"bugzilla": {
				"bug_id": "1458871",
				"alias": "xsa217",
				"creation_ts": "2017-06-05 17:42:55 +0000",
				"short_desc": "CVE-2017-10912 xsa217 xen: page transfer may allow PV guest to elevate privilege (XSA-217)",
				"delta_ts": "2021-02-17 02:04:31 +0000",
				"bug_status": "CLOSED",
				"resolution": "WONTFIX",
				"keywords": "Security",
				"priority": "high",
				"bug_severity": "high",
				"depends_on": [
					"1463247"
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10478256",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-05 17:42:55 +0000",
						"thetext": "ISSUE DESCRIPTION\n=================\n\nDomains controlling other domains are permitted to map pages owned by\nthe domain being controlled.  If the controlling domain unmaps such a\npage without flushing the TLB, and if soon after the domain being\ncontrolled transfers this page to another PV domain (via\nGNTTABOP_transfer or, indirectly, XENMEM_exchange), and that third\ndomain uses the page as a page table, the controlling domain will have\nwrite access to a live page table until the applicable TLB entry is\nflushed or evicted.  Note that the domain being controlled is\nnecessarily HVM, while the controlling domain is PV.\n\nIMPACT\n======\n\nA malicious pair of guests may be able to access all of system memory,\nallowing for all of privilege escalation, host crashes, and\ninformation leaks.\n\nVULNERABLE SYSTEMS\n==================\n\nAll Xen versions are vulnerable.\n\nOnly x86 systems are affected.  ARM systems are not vulnerable.\n\nOnly systems where an attacker can control both a PV and an HVM guest\nare vulnerable.  This must be presumed to include systems containing\nHVM domains with service domains such as stub domain device models.\n\nSystems containing only PV guests are not vulnerable.\n\nSystems containing only HVM domains serviced by dom0 device model\nprocesses are not vulnerable.  Note that with libxl, xl, and libvirt,\nHVM domains use dom0 device model processes by default.\n\nMITIGATION\n==========\n\nThere is no mitigation for this vulnerability.\n\nSwitching from stub device models to dom0 process device models is not\nrecommended as a mitigation, as in practice the vulnerability is\nlikely to be hard to exploit through this route; whereas dom0 process\ndevice models may have unknown vulnerabilities.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-217.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Jann Horn (Google)"
					},
					{
						"isprivate": "0",
						"commentid": "10523000",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:34:53 +0000",
						"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
					}
				]
			}
		},
		{
			"bug_id": 1458872,
			"parent": true,
			"security": true,
			"title": "CVE-2017-10913 CVE-2017-10914 xsa218 xen: Races in the grant table unmap code (XSA-218)",
			"bugzilla": {
				"bug_id": "1458872",
				"alias": "xsa218",
				"creation_ts": "2017-06-05 17:43:01 +0000",
				"short_desc": "CVE-2017-10913 CVE-2017-10914 xsa218 xen: Races in the grant table unmap code (XSA-218)",
				"delta_ts": "2021-02-17 02:04:33 +0000",
				"bug_status": "CLOSED",
				"resolution": "WONTFIX",
				"keywords": "Security",
				"priority": "high",
				"bug_severity": "high",
				"depends_on": [
					"1463247"
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10478257",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-05 17:43:01 +0000",
						"thetext": "ISSUE DESCRIPTION\n=================\n\nWe have discovered two bugs in the code unmapping grant references.\n\n* When a grant had been mapped twice by a backend domain, and then\nunmapped by two concurrent unmap calls, the frontend may be informed\nthat the page had no further mappings when the first call completed rather\nthan when the second call completed.\n\n* A race triggerable by an unprivileged guest could cause a grant\nmaptrack entry for grants to be \"freed\" twice.  The ultimate effect of\nthis would be for maptrack entries for a single domain to be re-used.\n\nIMPACT\n======\n\nFor the first issue, for a short window of time, a malicious backend\ncould still read and write memory that the frontend thought was its\nown again.  Depending on the usage, this could be either an\ninformation leak, or a backend-to-frontend privilege escalation.\n\nThe second issue is more difficult to analyze. It can probably cause\nreference counts to leak, preventing memory from being freed on domain\ndestruction (denial-of-service), but information leakage or host\nprivilege escalation cannot be ruled out.\n\nVULNERABLE SYSTEMS\n==================\n\nAll versions of Xen are vulnerable.\n\nBoth ARM and x86 are vulnerable.\n\nOn x86, systems with either PV or HVM guests are vulnerable.\n\nMITIGATION\n==========\n\nNone.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-218.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Jann Horn (Google)"
					},
					{
						"isprivate": "0",
						"commentid": "10523001",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:35:11 +0000",
						"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
					}
				]
			}
		},
		{
			"bug_id": 1458873,
			"parent": true,
			"security": true,
			"title": "CVE-2017-10915 xsa219 xen: x86: insufficient reference counts during shadow emulation (XSA-219)",
			"bugzilla": {
				"bug_id": "1458873",
				"alias": "xsa219",
				"creation_ts": "2017-06-05 17:43:06 +0000",
				"short_desc": "CVE-2017-10915 xsa219 xen: x86: insufficient reference counts during shadow emulation (XSA-219)",
				"delta_ts": "2021-02-17 02:04:34 +0000",
				"bug_status": "CLOSED",
				"resolution": "WONTFIX",
				"keywords": "Security",
				"priority": "high",
				"bug_severity": "high",
				"depends_on": [
					"1463247"
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10478258",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-05 17:43:06 +0000",
						"thetext": "ISSUE DESCRIPTION\n=================\n\nWhen using shadow paging, writes to guest pagetables must be trapped and\nemulated, so the shadows can be suitably adjusted as well.\n\nWhen emulating the write, Xen maps the guests pagetable(s) to make the final\nadjustment and leave the guest's view of its state consistent.\n\nHowever, when mapping the frame, Xen drops the page reference before\nperforming the write.  This is a race window where the underlying frame can\nchange ownership.\n\nOne possible attack scenario is for the frame to change ownership and to be\ninserted into a PV guest's pagetables.  At that point, the emulated write will\nbe an unaudited modification to the PV pagetables whose value is under guest\ncontrol.\n\nIMPACT\n======\n\nA malicious pair of guests may be able to elevate their privilege to that of\nXen.\n\nVULNERABLE SYSTEMS\n==================\n\nAll versions of Xen are vulnerable.\n\nOnly x86 systems are affected.  ARM systems are not vulnerable.\n\nHVM guests using shadow mode paging can exploit this vulnerability.  HVM guests\nusing Hardware Assisted Paging (HAP) cannot exploit this vulnerability.\n\nTo discover whether your HVM guests are using HAP, or shadow page\ntables: request debug key `q' (from the Xen console, or with\n`xl debug-keys q').  This will print (to the console, and visible in\n`xl dmesg'), debug information for every domain, containing something\nlike this:\n\n(XEN) General information for domain 2:\n(XEN)     refcnt=1 dying=2 pause_count=2\n(XEN)     nr_pages=2 xenheap_pages=0 shared_pages=0 paged_pages=0 dirty_cpus={} max_pages=262400\n(XEN)     handle=ef58ef1a-784d-4e59-8079-42bdee87f219 vm_assist=00000000\n(XEN)     paging assistance: hap refcounts translate external\n^^^\nThe presence of `hap' here indicates that the host is not\nvulnerable to this domain.  For an HVM domain the presence of `shadow'\nindicates that the domain can exploit the vulnerability.\n\nXen 4.6 and later have the option to compile-out shadow paging support.  (The\ndefault is to compile with shadow paging support).  If Xen is built without\nshadow support, it is not vulnerable.\n\nExploiting this race condition requires coordination between an x86 HVM guest\nusing shadow paging, and a PV guest.\n\nRunning only HVM guests avoids the vulnerability, unless stub device\nmodels are in use (since stub device models are PV domains, each\ncontrolled by the corresponding guest).\n\nRunning only PV guests avoids the vulnerability.\n\nMitigation:\n\nWhere the HVM guest is explicitly configured to use shadow paging (eg\nvia the `hap=0' xl domain configuration file parameter), changing to\nHAP (eg by setting `hap=1') will avoid exposing the vulnerability to\nthose guests.  HAP is the default (in upstream Xen), where the\nhardware supports it; so this mitigation is only applicable if HAP has\nbeen disabled by configuration.\n\n(This mitigation is not applicable to PV guests.)\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-219.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Andrew Cooper (Citrix)"
					},
					{
						"isprivate": "0",
						"commentid": "10523002",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:35:29 +0000",
						"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
					}
				]
			}
		},
		{
			"bug_id": 1458874,
			"parent": true,
			"security": true,
			"title": "CVE-2017-10916 xsa220 xen: x86: PKRU and BND* leakage between vCPU-s (XSA-220)",
			"bugzilla": {
				"bug_id": "1458874",
				"alias": "xsa220",
				"creation_ts": "2017-06-05 17:43:12 +0000",
				"short_desc": "CVE-2017-10916 xsa220 xen: x86: PKRU and BND* leakage between vCPU-s (XSA-220)",
				"delta_ts": "2021-02-17 02:04:36 +0000",
				"bug_status": "CLOSED",
				"resolution": "NOTABUG",
				"keywords": "Security",
				"priority": "high",
				"bug_severity": "high",
				"depends_on": [
					"1463247"
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10478259",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-05 17:43:12 +0000",
						"thetext": "ISSUE DESCRIPTION\n=================\n\nMemory Protection Extensions (MPX) and Protection Key (PKU) are features in\nnewer processors, whose state is intended to be per-thread and context\nswitched along with all other XSAVE state.\n\nXen's vCPU context switch code would save and restore the state only\nif the guest had set the relevant XSTATE enable bits.  However,\nsurprisingly, the use of these features is not dependent (PKU) or may\nnot be dependent (MPX) on having the relevant XSTATE bits enabled.\n\nVMs which use MPX or PKU, and context switch the state manually rather\nthan via XSAVE, will have the state leak between vCPUs (possibly,\nbetween vCPUs in different guests).  This in turn corrupts state in\nthe destination vCPU, and hence may lead to weakened protections\n\nExperimentally, MPX appears not to make any interaction with BND*\nstate if BNDCFGS.EN is set but XCR0.BND{CSR,REGS} are clear.  However,\nthe SDM is not clear in this case; therefore MPX is included in this\nadvisory as a precaution.\n\nIMPACT\n======\n\nThere is an information leak, of control information mentioning\npointers into guest address space; this may weaken address space\nrandomisation and make other attacks easier.\n\nWhen an innocent guest acquires leaked state, it will run with\nincorrect protection state.  This could weaken the protection intended\nby the MPX or PKU features, making other attacks easier which would\notherwise be excluded; and the incorrect state could also cause a\ndenial of service by preventing legitimate accesses.\n\nVULNERABLE SYSTEMS\n==================\n\nXen 4.4 and earlier are not vulnerable, as they do not use or expose\nMPX or PKU to guests.  Xen 4.5 and later expose MPX to guests.  Xen\n4.7 and later expose PKU to guests.  Therefore, Xen 4.5 and later are\nvulnerable.\n\nOnly x86 hardware implementing the MPX or PKU features is vulnerable.\nAt the time of writing, these are Intel Skylake (and later) processors\nfor MPX, and Intel Skylake Server (and later) processors for PKU.\n\nARM hardware is not vulnerable.\n\nThe vulnerability is only exposed to HVM guests.  PV guests cannot\nexploit the vulnerability.\n\nVulnerable guest operating systems\n- ----------------------------------\n\nGuests which use XSAVE for context switching PKU and MPX state are not\nvulnerable to inbound corruption caused by another malicious domain.\n\nWith respect to PKU, the remaining outbound information leak is of no\nconceivable consequence.  And, experimentally, MPX does not appear to\nhave a real vulnerability, even though the CPU documentation is not\nclear.\n\nTherefore we think that these guests (those which use XSAVE) are not\nvulnerable.\n\nLinux uses XSAVE, so is therefore not vulnerable.\n\nMITIGATION\n==========\n\nPassing \"pku=0\" on the hypervisor command line will avoid the PKU\nvulnerability (by not advertising the feature to guests).\n\nThere is no corresponding option for the probably-theoretical MPX\nvulnerability.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-220.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Andrew Cooper (Citrix)"
					},
					{
						"isprivate": "0",
						"commentid": "10523003",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:35:49 +0000",
						"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
					}
				]
			}
		},
		{
			"bug_id": 1458875,
			"parent": true,
			"security": true,
			"title": "CVE-2017-10917 xsa221 xen: NULL pointer deref in event channel poll (XSA-221)",
			"bugzilla": {
				"bug_id": "1458875",
				"alias": "xsa221",
				"creation_ts": "2017-06-05 17:43:18 +0000",
				"short_desc": "CVE-2017-10917 xsa221 xen: NULL pointer deref in event channel poll (XSA-221)",
				"delta_ts": "2021-02-17 02:04:05 +0000",
				"bug_status": "CLOSED",
				"resolution": "NOTABUG",
				"keywords": "Security",
				"priority": "high",
				"bug_severity": "high",
				"depends_on": [
					"1463231"
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10478260",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-05 17:43:18 +0000",
						"thetext": "ISSUE DESCRIPTION\n=================\n\nWhen polling event channels, in general arbitrary port numbers can be\nspecified.  Specifically, there is no requirement that a polled event\nchannel ports has ever been created.  When the code was generalised\nfrom an earlier implementation, introducing some intermediate\npointers, a check should have been made that these intermediate\npointers are non-NULL.  However, that check was omitted.\n\nIMPACT\n======\n\nA malicious or buggy guest may cause the hypervisor to access\naddresses it doesn't control, usually leading to a host crash (Denial\nof Service).  Information leaks cannot be excluded.\n\nVULNERABLE SYSTEMS\n==================\n\nXen versions 4.4 and newer are vulnerable.  Xen versions 4.3 and\nearlier are not affected.\n\nBoth x86 and ARM systems are vulnerable.\n\nWhile all guest kinds can cause a Denial of Service, only x86 PV guests\nmay be able to leverage the possible information leaks.\n\nMITIGATION\n==========\n\nThere is no known mitigation.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-221.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Ankur Arora (Oracle)"
					},
					{
						"isprivate": "0",
						"commentid": "10522850",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:12:29 +0000",
						"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463231]"
					}
				]
			}
		},
		{
			"bug_id": 1458876,
			"parent": true,
			"security": true,
			"title": "CVE-2017-10918 xsa222 xen: stale P2M mappings due to insufficient error checking (XSA-222)",
			"bugzilla": {
				"bug_id": "1458876",
				"alias": "xsa222",
				"creation_ts": "2017-06-05 17:43:24 +0000",
				"short_desc": "CVE-2017-10918 xsa222 xen: stale P2M mappings due to insufficient error checking (XSA-222)",
				"delta_ts": "2021-02-17 02:04:07 +0000",
				"bug_status": "CLOSED",
				"resolution": "WONTFIX",
				"keywords": "Security",
				"priority": "high",
				"bug_severity": "high",
				"depends_on": [
					"1463247"
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10478261",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-05 17:43:24 +0000",
						"thetext": "ISSUE DESCRIPTION\n=================\n\nCertain actions require removing pages from a guest's P2M\n(Physical-to-Machine) mapping.  When large pages are in use to map\nguest pages in the 2nd-stage page tables, such a removal operation may\nincur a memory allocation (to replace a large mapping with individual\nsmaller ones).  If this allocation fails, these errors are ignored by\nthe callers, which would then continue and (for example) free the\nreferenced page for reuse.  This leaves the guest with a mapping to a\npage it shouldn't have access to.\n\nThe allocation involved comes from a separate pool of memory created\nwhen the domain is created; under normal operating conditions it never\nfails, but a malicious guest may be able to engineer situations where\nthis pool is exhausted.\n\nIMPACT\n======\n\nA malicious guest may be able to access memory it doesn't own,\npotentially allowing privilege escalation, host crashes, or\ninformation leakage.\n\nVULNERABLE SYSTEMS\n==================\n\nXen versions from at least 3.2 onwards are vulnerable.  Older versions\nhave not been inspected.\n\nBoth x86 and ARM systems are vulnerable.\n\nOn x86 systems, only HVM guests can leverage the vulnerability.\n\nMitigation:\n\nOn x86, specifying \"hap_1gb=0 hap_2mb=0\" on the hypervisor command\nline will avoid the vulnerability.\n\nAlternatively, running all x86 HVM guests in shadow mode will also\navoid this vulnerability.  (For example, by specifying \"hap=0\" in the\nxl domain configuration file.)\n\nThere is no known mitigation on ARM systems.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-222.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Julien Grall (ARM)"
					},
					{
						"isprivate": "0",
						"commentid": "10523010",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:36:10 +0000",
						"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
					}
				]
			}
		},
		{
			"bug_id": 1458877,
			"parent": true,
			"security": true,
			"title": "CVE-2017-10919 xsa223 xen: ARM guest disabling interrupt may crash Xen (XSA-223)",
			"bugzilla": {
				"bug_id": "1458877",
				"alias": "xsa223",
				"creation_ts": "2017-06-05 17:43:29 +0000",
				"short_desc": "CVE-2017-10919 xsa223 xen: ARM guest disabling interrupt may crash Xen (XSA-223)",
				"delta_ts": "2021-02-17 02:04:09 +0000",
				"bug_status": "CLOSED",
				"resolution": "WONTFIX",
				"keywords": "Security",
				"priority": "medium",
				"bug_severity": "medium",
				"depends_on": [
					"1463247"
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10478262",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-05 17:43:29 +0000",
						"thetext": "ISSUE DESCRIPTION\n=================\n\nVirtual interrupt injection could be triggered by a guest when sending\nan SGI (e.g IPI) to any vCPU or by configuring timers. When the virtual\ninterrupt is masked, a missing check in the injection path may result in\nreading invalid hardware register or crashing the host.\n\nIMPACT\n======\n\nA guest may cause a hypervisor crash, resulting in a Denial of Service\n(DoS).\n\nVULNERABLE SYSTEMS\n==================\n\nAll Xen versions which support ARM are affected.\n\nx86 systems are not affected.\n\nMitigation:\n\nOn systems where the guest kernel is controlled by the host rather than\nguest administrator, running only kernels which do not disable SGI and\nPPI (i.e IRQ < 32) will prevent untrusted guest users from exploiting\nthis issue. However untrusted guest administrators can still trigger it\nunless further steps are taken to prevent them from loading code into\nthe kernel (e.g by disabling loadable modules etc) or from using other\nmechanisms which allow them to run code at kernel privilege.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-223.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Julien Grall (ARM)"
					},
					{
						"isprivate": "0",
						"commentid": "10523013",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:36:29 +0000",
						"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
					}
				]
			}
		},
		{
			"bug_id": 1458878,
			"parent": true,
			"security": true,
			"title": "CVE-2017-10920 CVE-2017-10921 CVE-2017-10922 xsa224 xen: grant table operations mishandle reference counts (XSA-224)",
			"bugzilla": {
				"bug_id": "1458878",
				"alias": "xsa224",
				"creation_ts": "2017-06-05 17:43:35 +0000",
				"short_desc": "CVE-2017-10920 CVE-2017-10921 CVE-2017-10922 xsa224 xen: grant table operations mishandle reference counts (XSA-224)",
				"delta_ts": "2021-02-17 02:04:10 +0000",
				"bug_status": "CLOSED",
				"resolution": "WONTFIX",
				"keywords": "Security",
				"priority": "high",
				"bug_severity": "high",
				"depends_on": [
					"1463247"
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10478264",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-05 17:43:35 +0000",
						"thetext": "ISSUE DESCRIPTION\n=================\n\nWe have discovered a number of bugs in the code mapping and unmapping\ngrant references.\n\n* If a grant is mapped with both the GNTMAP_device_map and\nGNTMAP_host_map flags, but unmapped only with host_map, the device_map\nportion remains but the page reference counts are lowered as though it\nhad been removed. This bug can be leveraged cause a page's reference\ncounts and type counts to fall to zero while retaining writeable\nmappings to the page.\n\n* Under some specific conditions, if a grant is mapped with both the\nGNTMAP_device_map and GNTMAP_host_map flags, the operation may not\ngrab sufficient type counts.  When the grant is then unmapped, the\ntype count will be erroneously reduced.  This bug can be leveraged\ncause a page's reference counts and type counts to fall to zero while\nretaining writeable mappings to the page.\n\n* When a grant reference is given to an MMIO region (as opposed to a\nnormal guest page), if the grant is mapped with only the\nGNTMAP_device_map flag set, a mapping is created at host_addr anyway.\nThis does *not* cause reference counts to change, but there will be no\nrecord of this mapping, so it will not be considered when reporting\nwhether the grant is still in use.\n\nIMPACT\n======\n\nFor the worst issue, a PV guest could gain a writeable mapping of its\nown pagetable, allowing it to escalate its privileges to that of the\nhost.\n\nVULNERABLE SYSTEMS\n==================\n\nAll versions of Xen are vulnerable.\n\nOnly x86 systems are vulnerable.\n\nAny system running untrusted PV guests is vulnerable.\n\nSystems with untrusted HVM guests are only vulnerable if those guests\nare served by a trusted PV backend which is vulnerable: Namely, one\nwhich calls grant_map() with both the GNTMAP_device_map and\nGNTMAP_host_map flags.  The security team is not aware of any backends\nwhich are vulnerable.\n\nMitigation:\n\nRunning only HVM guests will avoid this vulnerability.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-224.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Jan Beulich (SUSE)"
					},
					{
						"isprivate": "0",
						"commentid": "10523014",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:36:46 +0000",
						"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
					}
				]
			}
		},
		{
			"bug_id": 1459515,
			"parent": true,
			"security": true,
			"title": "CVE-2017-10923 xsa225 xen: arm: vgic: Out-of-bound access when sending SGIs (XSA-225)",
			"bugzilla": {
				"bug_id": "1459515",
				"alias": "xsa225",
				"creation_ts": "2017-06-07 10:52:49 +0000",
				"short_desc": "CVE-2017-10923 xsa225 xen: arm: vgic: Out-of-bound access when sending SGIs (XSA-225)",
				"delta_ts": "2021-02-17 02:02:53 +0000",
				"bug_status": "CLOSED",
				"resolution": "NOTABUG",
				"keywords": "Security",
				"priority": "medium",
				"bug_severity": "medium",
				"depends_on": [
					"1463247"
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10484986",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-07 10:52:49 +0000",
						"thetext": "ISSUE DESCRIPTION\n=================\n\nARM guests can send SGI (i.e. IPI) targeting a list of vCPUs using the\nMMIO register GICD_SGIR (GICv2) or System Register ICC_SGI1R (GICv3).\nHowever, the emulation code does not sanitize the list and will\ndirectly access an array without checking whether the array index is\nwithin bounds.\n\nIMPACT\n======\n\nA guest may cause a hypervisor crash, resulting in a Denial of Service\n(DoS).\n\nVULNERABLE SYSTEMS\n==================\n\nXen versions 4.6 and onwards are affected.  Xen versions 4.5 and\nearlier are not affected.\n\nOnly ARM systems are affected.  x86 systems are not affected.\n\nMitigation:\n\nOn systems where the guest kernel is controlled by the host rather than\nguest administrator, running only kernels which only send sane IPIs\n(i.e. targeting valid CPUs) will prevent untrusted guest users from\nexploiting this issue.  However untrusted guest administrators can\nstill trigger it unless further steps are taken to prevent them from\nloading code into the kernel (e.g by disabling loadable modules etc) or\nfrom using other mechanisms which allow them to run code at kernel\nprivilege.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-225.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Julien Grall (ARM)"
					},
					{
						"isprivate": "0",
						"commentid": "10523015",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:37:05 +0000",
						"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
					}
				]
			}
		},
		{
			"bug_id": 1463231,
			"security": true,
			"title": "CVE-2017-10917 xen: xsa221 xen: NULL pointer deref in event channel poll (XSA-221) [fedora-all]",
			"bugzilla": {
				"bug_id": "1463231",
				"creation_ts": "2017-06-20 12:12:17 +0000",
				"short_desc": "CVE-2017-10917 xen: xsa221 xen: NULL pointer deref in event channel poll (XSA-221) [fedora-all]",
				"delta_ts": "2017-07-12 03:21:29 +0000",
				"bug_status": "CLOSED",
				"resolution": "ERRATA",
				"keywords": "Security, SecurityTracking",
				"priority": "high",
				"bug_severity": "high",
				"blocked": [
					{
						"bug_id": "1458875",
						"alias": "xsa221",
						"creation_ts": "2017-06-05 17:43:18 +0000",
						"short_desc": "CVE-2017-10917 xsa221 xen: NULL pointer deref in event channel poll (XSA-221)",
						"delta_ts": "2021-02-17 02:04:05 +0000",
						"bug_status": "CLOSED",
						"resolution": "NOTABUG",
						"keywords": "Security",
						"priority": "high",
						"bug_severity": "high",
						"depends_on": [
							"1463231"
						],
						"long_desc": [
							{
								"isprivate": "0",
								"commentid": "10478260",
								"comment_count": "0",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-05 17:43:18 +0000",
								"thetext": "ISSUE DESCRIPTION\n=================\n\nWhen polling event channels, in general arbitrary port numbers can be\nspecified.  Specifically, there is no requirement that a polled event\nchannel ports has ever been created.  When the code was generalised\nfrom an earlier implementation, introducing some intermediate\npointers, a check should have been made that these intermediate\npointers are non-NULL.  However, that check was omitted.\n\nIMPACT\n======\n\nA malicious or buggy guest may cause the hypervisor to access\naddresses it doesn't control, usually leading to a host crash (Denial\nof Service).  Information leaks cannot be excluded.\n\nVULNERABLE SYSTEMS\n==================\n\nXen versions 4.4 and newer are vulnerable.  Xen versions 4.3 and\nearlier are not affected.\n\nBoth x86 and ARM systems are vulnerable.\n\nWhile all guest kinds can cause a Denial of Service, only x86 PV guests\nmay be able to leverage the possible information leaks.\n\nMITIGATION\n==========\n\nThere is no known mitigation.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-221.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Ankur Arora (Oracle)"
							},
							{
								"isprivate": "0",
								"commentid": "10522850",
								"comment_count": "1",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-20 12:12:29 +0000",
								"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463231]"
							}
						]
					}
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10522848",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:12:17 +0000",
						"thetext": "\nThis is an automatically created tracking bug!  It was created to ensure\nthat one or more security vulnerabilities are fixed in affected versions\nof fedora-all.\n\nFor comments that are specific to the vulnerability please use bugs filed\nagainst the \"Security Response\" product referenced in the \"Blocks\" field.\n\nFor more information see:\nhttp://fedoraproject.org/wiki/Security/TrackingBugs\n\nWhen submitting as an update, use the fedpkg template provided in the next\ncomment(s).  This will include the bug IDs of this tracking bug as well as\nthe relevant top-level CVE bugs.\n\nPlease also mention the CVE IDs being fixed in the RPM changelog and the\nfedpkg commit message.\n\nNOTE: this issue affects multiple supported versions of Fedora. While only\none tracking bug has been filed, please correct all affected versions at\nthe same time.  If you need to fix the versions independent of each other,\nyou may clone this bug as appropriate."
					},
					{
						"isprivate": "0",
						"commentid": "10522849",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:12:24 +0000",
						"thetext": "Use the following template to for the 'fedpkg update' request to submit an\nupdate for this issue as it contains the top-level parent bug(s) as well as\nthis tracking bug.  This will ensure that all associated bugs get updated\nwhen new packages are pushed to stable.\n\n=====\n\n# bugfix, security, enhancement, newpackage (required)\ntype=security\n\n# testing, stable\nrequest=testing\n\n# Bug numbers: 1234,9876\nbugs=1458875\n\n# Description of your update\nnotes=Security fix for [PUT CVEs HERE]\n\n# Enable request automation based on the stable/unstable karma thresholds\nautokarma=True\nstable_karma=3\nunstable_karma=-3\n\n# Automatically close bugs when this marked as stable\nclose_bugs=True\n\n# Suggest that users restart after update\nsuggest_reboot=False\n\n======\n\nAdditionally, you may opt to use the bodhi web interface to submit updates:\n\nhttps://bodhi.fedoraproject.org/updates/new"
					},
					{
						"isprivate": "0",
						"commentid": "10529368",
						"comment_count": "2",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-21 21:53:03 +0000",
						"thetext": "xen-4.8.1-4.fc26 has been submitted as an update to Fedora 26. https://bodhi.fedoraproject.org/updates/FEDORA-2017-5c6a9b07a3"
					},
					{
						"isprivate": "0",
						"commentid": "10533218",
						"comment_count": "3",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-22 22:57:03 +0000",
						"thetext": "xen-4.7.2-7.fc25 has been submitted as an update to Fedora 25. https://bodhi.fedoraproject.org/updates/FEDORA-2017-c3149b5fcb"
					},
					{
						"isprivate": "0",
						"commentid": "10533235",
						"comment_count": "4",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-22 23:23:30 +0000",
						"thetext": "xen-4.6.5-7.fc24 has been submitted as an update to Fedora 24. https://bodhi.fedoraproject.org/updates/FEDORA-2017-b3bdaf58bc"
					},
					{
						"isprivate": "0",
						"commentid": "10533980",
						"comment_count": "5",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-23 06:25:53 +0000",
						"thetext": "xen-4.8.1-4.fc26 has been pushed to the Fedora 26 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-2017-5c6a9b07a3"
					},
					{
						"isprivate": "0",
						"commentid": "10536744",
						"comment_count": "6",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-23 21:53:53 +0000",
						"thetext": "xen-4.6.5-7.fc24 has been pushed to the Fedora 24 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-2017-b3bdaf58bc"
					},
					{
						"isprivate": "0",
						"commentid": "10536778",
						"comment_count": "7",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-23 22:22:49 +0000",
						"thetext": "xen-4.7.2-7.fc25 has been pushed to the Fedora 25 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-2017-c3149b5fcb"
					},
					{
						"isprivate": "0",
						"commentid": "10559302",
						"comment_count": "8",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-07-02 02:21:09 +0000",
						"thetext": "xen-4.6.5-7.fc24 has been pushed to the Fedora 24 stable repository. If problems still persist, please make note of it in this bug report."
					},
					{
						"isprivate": "0",
						"commentid": "10575929",
						"comment_count": "9",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-07-07 22:56:57 +0000",
						"thetext": "xen-4.8.1-4.fc26 has been pushed to the Fedora 26 stable repository. If problems still persist, please make note of it in this bug report."
					},
					{
						"isprivate": "0",
						"commentid": "10585229",
						"comment_count": "10",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-07-12 03:21:29 +0000",
						"thetext": "xen-4.7.2-7.fc25 has been pushed to the Fedora 25 stable repository. If problems still persist, please make note of it in this bug report."
					}
				]
			}
		},
		{
			"bug_id": 1463247,
			"security": true,
			"title": "CVE-2017-10911 CVE-2017-10912 CVE-2017-10913 CVE-2017-10914 CVE-2017-10915 CVE-2017-10916 CVE-2017-10918 CVE-2017-10919 CVE-2017-10920 CVE-2017-10921 CVE-2017-10922 CVE-2017-10923 xen: various flaws [fedora-all]",
			"bugzilla": {
				"bug_id": "1463247",
				"creation_ts": "2017-06-20 12:34:15 +0000",
				"short_desc": "CVE-2017-10911 CVE-2017-10912 CVE-2017-10913 CVE-2017-10914 CVE-2017-10915 CVE-2017-10916 CVE-2017-10918 CVE-2017-10919 CVE-2017-10920 CVE-2017-10921 CVE-2017-10922 CVE-2017-10923 xen: various flaws [fedora-all]",
				"delta_ts": "2017-07-12 03:21:24 +0000",
				"bug_status": "CLOSED",
				"resolution": "ERRATA",
				"keywords": "Security, SecurityTracking",
				"priority": "high",
				"bug_severity": "high",
				"blocked": [
					{
						"bug_id": "1458870",
						"alias": "xsa216",
						"creation_ts": "2017-06-05 17:42:49 +0000",
						"short_desc": "CVE-2017-10911 xsa216 xen: blkif responses leak backend stack data (XSA-216)",
						"delta_ts": "2021-06-10 12:24:21 +0000",
						"bug_status": "CLOSED",
						"resolution": "ERRATA",
						"keywords": "Security",
						"priority": "low",
						"bug_severity": "low",
						"depends_on": [
							"1463247"
						],
						"blocked": [
							{
								"bug_id": "1458881",
								"error": "NotPermitted"
							}
						],
						"long_desc": [
							{
								"isprivate": "0",
								"commentid": "10478255",
								"comment_count": "0",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-05 17:42:49 +0000",
								"thetext": "ISSUE DESCRIPTION\n=================\n\nThe block interface response structure has some discontiguous fields.\nCertain backends populate the structure fields of an otherwise\nuninitialized instance of this structure on their stacks, leaking\ndata through the (internal or trailing) padding field.\n\nIMPACT\n======\n\nA malicious unprivileged guest may be able to obtain sensitive\ninformation from the host or other guests.\n\nVULNERABLE SYSTEMS\n==================\n\nAll Linux versions supporting the xen-blkback, blkback, or blktap\ndrivers are vulnerable.\n\nFreeBSD, NetBSD and Windows (with our without PV drivers) are not\nvulnerable (either because they do not have backends at all, or\nbecause they use a different implementation technique which does not\nsuffer from this problem).\n\nAll qemu versions supporting the Xen block backend are vulnerable.  The\nqemu-xen-traditional code base does not include such code, so is not\nvulnerable.  Note that an instance of qemu will be spawned to provide\nthe backend for most non-raw-format disks; so you may need to apply the\npatch to qemu even if you use only PV guests.\n\nMITIGATION\n==========\n\nThere's no mitigation available for x86 PV and ARM guests.\n\nFor x86 HVM guests it may be possible to change the guest\nconfiguaration such that a fully virtualized disk is being made\navailable instead.  However, this would normally entail changes inside\nthe guest itself.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-216.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Anthony Perard (Citrix)"
							},
							{
								"isprivate": "0",
								"commentid": "10522998",
								"comment_count": "1",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-20 12:34:26 +0000",
								"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
							}
						]
					},
					{
						"bug_id": "1458871",
						"alias": "xsa217",
						"creation_ts": "2017-06-05 17:42:55 +0000",
						"short_desc": "CVE-2017-10912 xsa217 xen: page transfer may allow PV guest to elevate privilege (XSA-217)",
						"delta_ts": "2021-02-17 02:04:31 +0000",
						"bug_status": "CLOSED",
						"resolution": "WONTFIX",
						"keywords": "Security",
						"priority": "high",
						"bug_severity": "high",
						"depends_on": [
							"1463247"
						],
						"long_desc": [
							{
								"isprivate": "0",
								"commentid": "10478256",
								"comment_count": "0",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-05 17:42:55 +0000",
								"thetext": "ISSUE DESCRIPTION\n=================\n\nDomains controlling other domains are permitted to map pages owned by\nthe domain being controlled.  If the controlling domain unmaps such a\npage without flushing the TLB, and if soon after the domain being\ncontrolled transfers this page to another PV domain (via\nGNTTABOP_transfer or, indirectly, XENMEM_exchange), and that third\ndomain uses the page as a page table, the controlling domain will have\nwrite access to a live page table until the applicable TLB entry is\nflushed or evicted.  Note that the domain being controlled is\nnecessarily HVM, while the controlling domain is PV.\n\nIMPACT\n======\n\nA malicious pair of guests may be able to access all of system memory,\nallowing for all of privilege escalation, host crashes, and\ninformation leaks.\n\nVULNERABLE SYSTEMS\n==================\n\nAll Xen versions are vulnerable.\n\nOnly x86 systems are affected.  ARM systems are not vulnerable.\n\nOnly systems where an attacker can control both a PV and an HVM guest\nare vulnerable.  This must be presumed to include systems containing\nHVM domains with service domains such as stub domain device models.\n\nSystems containing only PV guests are not vulnerable.\n\nSystems containing only HVM domains serviced by dom0 device model\nprocesses are not vulnerable.  Note that with libxl, xl, and libvirt,\nHVM domains use dom0 device model processes by default.\n\nMITIGATION\n==========\n\nThere is no mitigation for this vulnerability.\n\nSwitching from stub device models to dom0 process device models is not\nrecommended as a mitigation, as in practice the vulnerability is\nlikely to be hard to exploit through this route; whereas dom0 process\ndevice models may have unknown vulnerabilities.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-217.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Jann Horn (Google)"
							},
							{
								"isprivate": "0",
								"commentid": "10523000",
								"comment_count": "1",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-20 12:34:53 +0000",
								"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
							}
						]
					},
					{
						"bug_id": "1458872",
						"alias": "xsa218",
						"creation_ts": "2017-06-05 17:43:01 +0000",
						"short_desc": "CVE-2017-10913 CVE-2017-10914 xsa218 xen: Races in the grant table unmap code (XSA-218)",
						"delta_ts": "2021-02-17 02:04:33 +0000",
						"bug_status": "CLOSED",
						"resolution": "WONTFIX",
						"keywords": "Security",
						"priority": "high",
						"bug_severity": "high",
						"depends_on": [
							"1463247"
						],
						"long_desc": [
							{
								"isprivate": "0",
								"commentid": "10478257",
								"comment_count": "0",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-05 17:43:01 +0000",
								"thetext": "ISSUE DESCRIPTION\n=================\n\nWe have discovered two bugs in the code unmapping grant references.\n\n* When a grant had been mapped twice by a backend domain, and then\nunmapped by two concurrent unmap calls, the frontend may be informed\nthat the page had no further mappings when the first call completed rather\nthan when the second call completed.\n\n* A race triggerable by an unprivileged guest could cause a grant\nmaptrack entry for grants to be \"freed\" twice.  The ultimate effect of\nthis would be for maptrack entries for a single domain to be re-used.\n\nIMPACT\n======\n\nFor the first issue, for a short window of time, a malicious backend\ncould still read and write memory that the frontend thought was its\nown again.  Depending on the usage, this could be either an\ninformation leak, or a backend-to-frontend privilege escalation.\n\nThe second issue is more difficult to analyze. It can probably cause\nreference counts to leak, preventing memory from being freed on domain\ndestruction (denial-of-service), but information leakage or host\nprivilege escalation cannot be ruled out.\n\nVULNERABLE SYSTEMS\n==================\n\nAll versions of Xen are vulnerable.\n\nBoth ARM and x86 are vulnerable.\n\nOn x86, systems with either PV or HVM guests are vulnerable.\n\nMITIGATION\n==========\n\nNone.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-218.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Jann Horn (Google)"
							},
							{
								"isprivate": "0",
								"commentid": "10523001",
								"comment_count": "1",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-20 12:35:11 +0000",
								"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
							}
						]
					},
					{
						"bug_id": "1458873",
						"alias": "xsa219",
						"creation_ts": "2017-06-05 17:43:06 +0000",
						"short_desc": "CVE-2017-10915 xsa219 xen: x86: insufficient reference counts during shadow emulation (XSA-219)",
						"delta_ts": "2021-02-17 02:04:34 +0000",
						"bug_status": "CLOSED",
						"resolution": "WONTFIX",
						"keywords": "Security",
						"priority": "high",
						"bug_severity": "high",
						"depends_on": [
							"1463247"
						],
						"long_desc": [
							{
								"isprivate": "0",
								"commentid": "10478258",
								"comment_count": "0",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-05 17:43:06 +0000",
								"thetext": "ISSUE DESCRIPTION\n=================\n\nWhen using shadow paging, writes to guest pagetables must be trapped and\nemulated, so the shadows can be suitably adjusted as well.\n\nWhen emulating the write, Xen maps the guests pagetable(s) to make the final\nadjustment and leave the guest's view of its state consistent.\n\nHowever, when mapping the frame, Xen drops the page reference before\nperforming the write.  This is a race window where the underlying frame can\nchange ownership.\n\nOne possible attack scenario is for the frame to change ownership and to be\ninserted into a PV guest's pagetables.  At that point, the emulated write will\nbe an unaudited modification to the PV pagetables whose value is under guest\ncontrol.\n\nIMPACT\n======\n\nA malicious pair of guests may be able to elevate their privilege to that of\nXen.\n\nVULNERABLE SYSTEMS\n==================\n\nAll versions of Xen are vulnerable.\n\nOnly x86 systems are affected.  ARM systems are not vulnerable.\n\nHVM guests using shadow mode paging can exploit this vulnerability.  HVM guests\nusing Hardware Assisted Paging (HAP) cannot exploit this vulnerability.\n\nTo discover whether your HVM guests are using HAP, or shadow page\ntables: request debug key `q' (from the Xen console, or with\n`xl debug-keys q').  This will print (to the console, and visible in\n`xl dmesg'), debug information for every domain, containing something\nlike this:\n\n(XEN) General information for domain 2:\n(XEN)     refcnt=1 dying=2 pause_count=2\n(XEN)     nr_pages=2 xenheap_pages=0 shared_pages=0 paged_pages=0 dirty_cpus={} max_pages=262400\n(XEN)     handle=ef58ef1a-784d-4e59-8079-42bdee87f219 vm_assist=00000000\n(XEN)     paging assistance: hap refcounts translate external\n^^^\nThe presence of `hap' here indicates that the host is not\nvulnerable to this domain.  For an HVM domain the presence of `shadow'\nindicates that the domain can exploit the vulnerability.\n\nXen 4.6 and later have the option to compile-out shadow paging support.  (The\ndefault is to compile with shadow paging support).  If Xen is built without\nshadow support, it is not vulnerable.\n\nExploiting this race condition requires coordination between an x86 HVM guest\nusing shadow paging, and a PV guest.\n\nRunning only HVM guests avoids the vulnerability, unless stub device\nmodels are in use (since stub device models are PV domains, each\ncontrolled by the corresponding guest).\n\nRunning only PV guests avoids the vulnerability.\n\nMitigation:\n\nWhere the HVM guest is explicitly configured to use shadow paging (eg\nvia the `hap=0' xl domain configuration file parameter), changing to\nHAP (eg by setting `hap=1') will avoid exposing the vulnerability to\nthose guests.  HAP is the default (in upstream Xen), where the\nhardware supports it; so this mitigation is only applicable if HAP has\nbeen disabled by configuration.\n\n(This mitigation is not applicable to PV guests.)\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-219.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Andrew Cooper (Citrix)"
							},
							{
								"isprivate": "0",
								"commentid": "10523002",
								"comment_count": "1",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-20 12:35:29 +0000",
								"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
							}
						]
					},
					{
						"bug_id": "1458874",
						"alias": "xsa220",
						"creation_ts": "2017-06-05 17:43:12 +0000",
						"short_desc": "CVE-2017-10916 xsa220 xen: x86: PKRU and BND* leakage between vCPU-s (XSA-220)",
						"delta_ts": "2021-02-17 02:04:36 +0000",
						"bug_status": "CLOSED",
						"resolution": "NOTABUG",
						"keywords": "Security",
						"priority": "high",
						"bug_severity": "high",
						"depends_on": [
							"1463247"
						],
						"long_desc": [
							{
								"isprivate": "0",
								"commentid": "10478259",
								"comment_count": "0",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-05 17:43:12 +0000",
								"thetext": "ISSUE DESCRIPTION\n=================\n\nMemory Protection Extensions (MPX) and Protection Key (PKU) are features in\nnewer processors, whose state is intended to be per-thread and context\nswitched along with all other XSAVE state.\n\nXen's vCPU context switch code would save and restore the state only\nif the guest had set the relevant XSTATE enable bits.  However,\nsurprisingly, the use of these features is not dependent (PKU) or may\nnot be dependent (MPX) on having the relevant XSTATE bits enabled.\n\nVMs which use MPX or PKU, and context switch the state manually rather\nthan via XSAVE, will have the state leak between vCPUs (possibly,\nbetween vCPUs in different guests).  This in turn corrupts state in\nthe destination vCPU, and hence may lead to weakened protections\n\nExperimentally, MPX appears not to make any interaction with BND*\nstate if BNDCFGS.EN is set but XCR0.BND{CSR,REGS} are clear.  However,\nthe SDM is not clear in this case; therefore MPX is included in this\nadvisory as a precaution.\n\nIMPACT\n======\n\nThere is an information leak, of control information mentioning\npointers into guest address space; this may weaken address space\nrandomisation and make other attacks easier.\n\nWhen an innocent guest acquires leaked state, it will run with\nincorrect protection state.  This could weaken the protection intended\nby the MPX or PKU features, making other attacks easier which would\notherwise be excluded; and the incorrect state could also cause a\ndenial of service by preventing legitimate accesses.\n\nVULNERABLE SYSTEMS\n==================\n\nXen 4.4 and earlier are not vulnerable, as they do not use or expose\nMPX or PKU to guests.  Xen 4.5 and later expose MPX to guests.  Xen\n4.7 and later expose PKU to guests.  Therefore, Xen 4.5 and later are\nvulnerable.\n\nOnly x86 hardware implementing the MPX or PKU features is vulnerable.\nAt the time of writing, these are Intel Skylake (and later) processors\nfor MPX, and Intel Skylake Server (and later) processors for PKU.\n\nARM hardware is not vulnerable.\n\nThe vulnerability is only exposed to HVM guests.  PV guests cannot\nexploit the vulnerability.\n\nVulnerable guest operating systems\n- ----------------------------------\n\nGuests which use XSAVE for context switching PKU and MPX state are not\nvulnerable to inbound corruption caused by another malicious domain.\n\nWith respect to PKU, the remaining outbound information leak is of no\nconceivable consequence.  And, experimentally, MPX does not appear to\nhave a real vulnerability, even though the CPU documentation is not\nclear.\n\nTherefore we think that these guests (those which use XSAVE) are not\nvulnerable.\n\nLinux uses XSAVE, so is therefore not vulnerable.\n\nMITIGATION\n==========\n\nPassing \"pku=0\" on the hypervisor command line will avoid the PKU\nvulnerability (by not advertising the feature to guests).\n\nThere is no corresponding option for the probably-theoretical MPX\nvulnerability.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-220.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Andrew Cooper (Citrix)"
							},
							{
								"isprivate": "0",
								"commentid": "10523003",
								"comment_count": "1",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-20 12:35:49 +0000",
								"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
							}
						]
					},
					{
						"bug_id": "1458876",
						"alias": "xsa222",
						"creation_ts": "2017-06-05 17:43:24 +0000",
						"short_desc": "CVE-2017-10918 xsa222 xen: stale P2M mappings due to insufficient error checking (XSA-222)",
						"delta_ts": "2021-02-17 02:04:07 +0000",
						"bug_status": "CLOSED",
						"resolution": "WONTFIX",
						"keywords": "Security",
						"priority": "high",
						"bug_severity": "high",
						"depends_on": [
							"1463247"
						],
						"long_desc": [
							{
								"isprivate": "0",
								"commentid": "10478261",
								"comment_count": "0",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-05 17:43:24 +0000",
								"thetext": "ISSUE DESCRIPTION\n=================\n\nCertain actions require removing pages from a guest's P2M\n(Physical-to-Machine) mapping.  When large pages are in use to map\nguest pages in the 2nd-stage page tables, such a removal operation may\nincur a memory allocation (to replace a large mapping with individual\nsmaller ones).  If this allocation fails, these errors are ignored by\nthe callers, which would then continue and (for example) free the\nreferenced page for reuse.  This leaves the guest with a mapping to a\npage it shouldn't have access to.\n\nThe allocation involved comes from a separate pool of memory created\nwhen the domain is created; under normal operating conditions it never\nfails, but a malicious guest may be able to engineer situations where\nthis pool is exhausted.\n\nIMPACT\n======\n\nA malicious guest may be able to access memory it doesn't own,\npotentially allowing privilege escalation, host crashes, or\ninformation leakage.\n\nVULNERABLE SYSTEMS\n==================\n\nXen versions from at least 3.2 onwards are vulnerable.  Older versions\nhave not been inspected.\n\nBoth x86 and ARM systems are vulnerable.\n\nOn x86 systems, only HVM guests can leverage the vulnerability.\n\nMitigation:\n\nOn x86, specifying \"hap_1gb=0 hap_2mb=0\" on the hypervisor command\nline will avoid the vulnerability.\n\nAlternatively, running all x86 HVM guests in shadow mode will also\navoid this vulnerability.  (For example, by specifying \"hap=0\" in the\nxl domain configuration file.)\n\nThere is no known mitigation on ARM systems.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-222.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Julien Grall (ARM)"
							},
							{
								"isprivate": "0",
								"commentid": "10523010",
								"comment_count": "1",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-20 12:36:10 +0000",
								"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
							}
						]
					},
					{
						"bug_id": "1458877",
						"alias": "xsa223",
						"creation_ts": "2017-06-05 17:43:29 +0000",
						"short_desc": "CVE-2017-10919 xsa223 xen: ARM guest disabling interrupt may crash Xen (XSA-223)",
						"delta_ts": "2021-02-17 02:04:09 +0000",
						"bug_status": "CLOSED",
						"resolution": "WONTFIX",
						"keywords": "Security",
						"priority": "medium",
						"bug_severity": "medium",
						"depends_on": [
							"1463247"
						],
						"long_desc": [
							{
								"isprivate": "0",
								"commentid": "10478262",
								"comment_count": "0",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-05 17:43:29 +0000",
								"thetext": "ISSUE DESCRIPTION\n=================\n\nVirtual interrupt injection could be triggered by a guest when sending\nan SGI (e.g IPI) to any vCPU or by configuring timers. When the virtual\ninterrupt is masked, a missing check in the injection path may result in\nreading invalid hardware register or crashing the host.\n\nIMPACT\n======\n\nA guest may cause a hypervisor crash, resulting in a Denial of Service\n(DoS).\n\nVULNERABLE SYSTEMS\n==================\n\nAll Xen versions which support ARM are affected.\n\nx86 systems are not affected.\n\nMitigation:\n\nOn systems where the guest kernel is controlled by the host rather than\nguest administrator, running only kernels which do not disable SGI and\nPPI (i.e IRQ < 32) will prevent untrusted guest users from exploiting\nthis issue. However untrusted guest administrators can still trigger it\nunless further steps are taken to prevent them from loading code into\nthe kernel (e.g by disabling loadable modules etc) or from using other\nmechanisms which allow them to run code at kernel privilege.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-223.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Julien Grall (ARM)"
							},
							{
								"isprivate": "0",
								"commentid": "10523013",
								"comment_count": "1",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-20 12:36:29 +0000",
								"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
							}
						]
					},
					{
						"bug_id": "1458878",
						"alias": "xsa224",
						"creation_ts": "2017-06-05 17:43:35 +0000",
						"short_desc": "CVE-2017-10920 CVE-2017-10921 CVE-2017-10922 xsa224 xen: grant table operations mishandle reference counts (XSA-224)",
						"delta_ts": "2021-02-17 02:04:10 +0000",
						"bug_status": "CLOSED",
						"resolution": "WONTFIX",
						"keywords": "Security",
						"priority": "high",
						"bug_severity": "high",
						"depends_on": [
							"1463247"
						],
						"long_desc": [
							{
								"isprivate": "0",
								"commentid": "10478264",
								"comment_count": "0",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-05 17:43:35 +0000",
								"thetext": "ISSUE DESCRIPTION\n=================\n\nWe have discovered a number of bugs in the code mapping and unmapping\ngrant references.\n\n* If a grant is mapped with both the GNTMAP_device_map and\nGNTMAP_host_map flags, but unmapped only with host_map, the device_map\nportion remains but the page reference counts are lowered as though it\nhad been removed. This bug can be leveraged cause a page's reference\ncounts and type counts to fall to zero while retaining writeable\nmappings to the page.\n\n* Under some specific conditions, if a grant is mapped with both the\nGNTMAP_device_map and GNTMAP_host_map flags, the operation may not\ngrab sufficient type counts.  When the grant is then unmapped, the\ntype count will be erroneously reduced.  This bug can be leveraged\ncause a page's reference counts and type counts to fall to zero while\nretaining writeable mappings to the page.\n\n* When a grant reference is given to an MMIO region (as opposed to a\nnormal guest page), if the grant is mapped with only the\nGNTMAP_device_map flag set, a mapping is created at host_addr anyway.\nThis does *not* cause reference counts to change, but there will be no\nrecord of this mapping, so it will not be considered when reporting\nwhether the grant is still in use.\n\nIMPACT\n======\n\nFor the worst issue, a PV guest could gain a writeable mapping of its\nown pagetable, allowing it to escalate its privileges to that of the\nhost.\n\nVULNERABLE SYSTEMS\n==================\n\nAll versions of Xen are vulnerable.\n\nOnly x86 systems are vulnerable.\n\nAny system running untrusted PV guests is vulnerable.\n\nSystems with untrusted HVM guests are only vulnerable if those guests\nare served by a trusted PV backend which is vulnerable: Namely, one\nwhich calls grant_map() with both the GNTMAP_device_map and\nGNTMAP_host_map flags.  The security team is not aware of any backends\nwhich are vulnerable.\n\nMitigation:\n\nRunning only HVM guests will avoid this vulnerability.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-224.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Jan Beulich (SUSE)"
							},
							{
								"isprivate": "0",
								"commentid": "10523014",
								"comment_count": "1",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-20 12:36:46 +0000",
								"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
							}
						]
					},
					{
						"bug_id": "1459515",
						"alias": "xsa225",
						"creation_ts": "2017-06-07 10:52:49 +0000",
						"short_desc": "CVE-2017-10923 xsa225 xen: arm: vgic: Out-of-bound access when sending SGIs (XSA-225)",
						"delta_ts": "2021-02-17 02:02:53 +0000",
						"bug_status": "CLOSED",
						"resolution": "NOTABUG",
						"keywords": "Security",
						"priority": "medium",
						"bug_severity": "medium",
						"depends_on": [
							"1463247"
						],
						"long_desc": [
							{
								"isprivate": "0",
								"commentid": "10484986",
								"comment_count": "0",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-07 10:52:49 +0000",
								"thetext": "ISSUE DESCRIPTION\n=================\n\nARM guests can send SGI (i.e. IPI) targeting a list of vCPUs using the\nMMIO register GICD_SGIR (GICv2) or System Register ICC_SGI1R (GICv3).\nHowever, the emulation code does not sanitize the list and will\ndirectly access an array without checking whether the array index is\nwithin bounds.\n\nIMPACT\n======\n\nA guest may cause a hypervisor crash, resulting in a Denial of Service\n(DoS).\n\nVULNERABLE SYSTEMS\n==================\n\nXen versions 4.6 and onwards are affected.  Xen versions 4.5 and\nearlier are not affected.\n\nOnly ARM systems are affected.  x86 systems are not affected.\n\nMitigation:\n\nOn systems where the guest kernel is controlled by the host rather than\nguest administrator, running only kernels which only send sane IPIs\n(i.e. targeting valid CPUs) will prevent untrusted guest users from\nexploiting this issue.  However untrusted guest administrators can\nstill trigger it unless further steps are taken to prevent them from\nloading code into the kernel (e.g by disabling loadable modules etc) or\nfrom using other mechanisms which allow them to run code at kernel\nprivilege.\n\nExternal References:\n\nhttp://xenbits.xen.org/xsa/advisory-225.html\n\nAcknowledgements:\n\nName: the Xen project\nUpstream: Julien Grall (ARM)"
							},
							{
								"isprivate": "0",
								"commentid": "10523015",
								"comment_count": "1",
								"who": {
									"text": "amaris",
									"name": "Adam Mariš"
								},
								"bug_when": "2017-06-20 12:37:05 +0000",
								"thetext": "Created xen tracking bugs for this issue:\n\nAffects: fedora-all [bug 1463247]"
							}
						]
					}
				],
				"long_desc": [
					{
						"isprivate": "0",
						"commentid": "10522996",
						"comment_count": "0",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:34:15 +0000",
						"thetext": "\nThis is an automatically created tracking bug!  It was created to ensure\nthat one or more security vulnerabilities are fixed in affected versions\nof fedora-all.\n\nFor comments that are specific to the vulnerability please use bugs filed\nagainst the \"Security Response\" product referenced in the \"Blocks\" field.\n\nFor more information see:\nhttp://fedoraproject.org/wiki/Security/TrackingBugs\n\nWhen submitting as an update, use the fedpkg template provided in the next\ncomment(s).  This will include the bug IDs of this tracking bug as well as\nthe relevant top-level CVE bugs.\n\nPlease also mention the CVE IDs being fixed in the RPM changelog and the\nfedpkg commit message.\n\nNOTE: this issue affects multiple supported versions of Fedora. While only\none tracking bug has been filed, please correct all affected versions at\nthe same time.  If you need to fix the versions independent of each other,\nyou may clone this bug as appropriate."
					},
					{
						"isprivate": "0",
						"commentid": "10522997",
						"comment_count": "1",
						"who": {
							"text": "amaris",
							"name": "Adam Mariš"
						},
						"bug_when": "2017-06-20 12:34:22 +0000",
						"thetext": "Use the following template to for the 'fedpkg update' request to submit an\nupdate for this issue as it contains the top-level parent bug(s) as well as\nthis tracking bug.  This will ensure that all associated bugs get updated\nwhen new packages are pushed to stable.\n\n=====\n\n# bugfix, security, enhancement, newpackage (required)\ntype=security\n\n# testing, stable\nrequest=testing\n\n# Bug numbers: 1234,9876\nbugs=1458870,1458871,1458872,1458873,1458874,1458876,1458877,1458878,1459515\n\n# Description of your update\nnotes=Security fix for [PUT CVEs HERE]\n\n# Enable request automation based on the stable/unstable karma thresholds\nautokarma=True\nstable_karma=3\nunstable_karma=-3\n\n# Automatically close bugs when this marked as stable\nclose_bugs=True\n\n# Suggest that users restart after update\nsuggest_reboot=False\n\n======\n\nAdditionally, you may opt to use the bodhi web interface to submit updates:\n\nhttps://bodhi.fedoraproject.org/updates/new"
					},
					{
						"isprivate": "0",
						"commentid": "10529367",
						"comment_count": "2",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-21 21:52:43 +0000",
						"thetext": "xen-4.8.1-4.fc26 has been submitted as an update to Fedora 26. https://bodhi.fedoraproject.org/updates/FEDORA-2017-5c6a9b07a3"
					},
					{
						"isprivate": "0",
						"commentid": "10533217",
						"comment_count": "3",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-22 22:56:57 +0000",
						"thetext": "xen-4.7.2-7.fc25 has been submitted as an update to Fedora 25. https://bodhi.fedoraproject.org/updates/FEDORA-2017-c3149b5fcb"
					},
					{
						"isprivate": "0",
						"commentid": "10533234",
						"comment_count": "4",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-22 23:23:24 +0000",
						"thetext": "xen-4.6.5-7.fc24 has been submitted as an update to Fedora 24. https://bodhi.fedoraproject.org/updates/FEDORA-2017-b3bdaf58bc"
					},
					{
						"isprivate": "0",
						"commentid": "10533979",
						"comment_count": "5",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-23 06:25:48 +0000",
						"thetext": "xen-4.8.1-4.fc26 has been pushed to the Fedora 26 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-2017-5c6a9b07a3"
					},
					{
						"isprivate": "0",
						"commentid": "10536743",
						"comment_count": "6",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-23 21:53:48 +0000",
						"thetext": "xen-4.6.5-7.fc24 has been pushed to the Fedora 24 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-2017-b3bdaf58bc"
					},
					{
						"isprivate": "0",
						"commentid": "10536777",
						"comment_count": "7",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-06-23 22:22:44 +0000",
						"thetext": "xen-4.7.2-7.fc25 has been pushed to the Fedora 25 testing repository. If problems still persist, please make note of it in this bug report.\nSee https://fedoraproject.org/wiki/QA:Updates_Testing for\ninstructions on how to install test updates.\nYou can provide feedback for this update here: https://bodhi.fedoraproject.org/updates/FEDORA-2017-c3149b5fcb"
					},
					{
						"isprivate": "0",
						"commentid": "10559301",
						"comment_count": "8",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-07-02 02:19:10 +0000",
						"thetext": "xen-4.6.5-7.fc24 has been pushed to the Fedora 24 stable repository. If problems still persist, please make note of it in this bug report."
					},
					{
						"isprivate": "0",
						"commentid": "10575928",
						"comment_count": "9",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-07-07 22:56:54 +0000",
						"thetext": "xen-4.8.1-4.fc26 has been pushed to the Fedora 26 stable repository. If problems still persist, please make note of it in this bug report."
					},
					{
						"isprivate": "0",
						"commentid": "10585227",
						"comment_count": "10",
						"who": {
							"text": "updates",
							"name": "Fedora Update System"
						},
						"bug_when": "2017-07-12 03:21:24 +0000",
						"thetext": "xen-4.7.2-7.fc25 has been pushed to the Fedora 25 stable repository. If problems still persist, please make note of it in this bug report."
					}
				]
			}
		}
	],
	"builds": [
		{
			"epoch": 0,
			"nvr": "xen-4.7.2-7.fc25",
			"release_id": 15,
			"signed": true,
			"type": "rpm",
			"package": {
				"i686": [
					{
						"name": "xen-libs",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "i686"
					},
					{
						"name": "xen-debuginfo",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "i686"
					},
					{
						"name": "xen-licenses",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "i686"
					},
					{
						"name": "xen-ocaml",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "i686"
					},
					{
						"name": "xen-devel",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "i686"
					},
					{
						"name": "xen-runtime",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "i686"
					},
					{
						"name": "xen",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "i686"
					},
					{
						"name": "xen-ocaml-devel",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "i686"
					},
					{
						"name": "xen-doc",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "i686"
					},
					{
						"name": "xen-hypervisor",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "i686"
					}
				],
				"src": [
					{
						"name": "xen",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "src"
					}
				],
				"x86_64": [
					{
						"name": "xen-ocaml-devel",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "x86_64"
					},
					{
						"name": "xen-libs",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "x86_64"
					},
					{
						"name": "xen-devel",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "x86_64"
					},
					{
						"name": "xen-debuginfo",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "x86_64"
					},
					{
						"name": "xen-doc",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "x86_64"
					},
					{
						"name": "xen-hypervisor",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "x86_64"
					},
					{
						"name": "xen-runtime",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "x86_64"
					},
					{
						"name": "xen-licenses",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "x86_64"
					},
					{
						"name": "xen-ocaml",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "x86_64"
					},
					{
						"name": "xen",
						"version": "4.7.2",
						"release": "7.fc25",
						"arch": "x86_64"
					}
				]
			}
		}
	],
	"close_bugs": true,
	"comments": [
		{
			"id": 625795,
			"text": "This update has been submitted for testing by myoung. ",
			"timestamp": "2017-06-22 22:56:50",
			"update_id": 90685,
			"user": {
				"avatar": "https://apps.fedoraproject.org/img/icons/bodhi-24.png",
				"id": 91,
				"name": "bodhi",
				"openid": "bodhi.id.fedoraproject.org"
			},
			"user_id": 91
		},
		{
			"id": 626388,
			"text": "This update has been pushed to testing.",
			"timestamp": "2017-06-23 22:23:09",
			"update_id": 90685,
			"user": {
				"avatar": "https://apps.fedoraproject.org/img/icons/bodhi-24.png",
				"id": 91,
				"name": "bodhi",
				"openid": "bodhi.id.fedoraproject.org"
			},
			"user_id": 91
		},
		{
			"id": 627067,
			"karma": 1,
			"text": "works for me in a VM",
			"timestamp": "2017-06-25 16:17:01",
			"update_id": 90685,
			"user": {
				"avatar": "https://seccdn.libravatar.org/avatar/054959f4db5d1ad8f22cae1ba73e26ebfd3edd6690c21cc7ee00608f294ff22a?s=24&d=retro",
				"email": "cserpentis@gmail.com",
				"groups": [
					{
						"name": "packager"
					},
					{
						"name": "ipausers"
					},
					{
						"name": "fedora-contributor"
					},
					{
						"name": "signed_fpca"
					},
					{
						"name": "fedorabugs"
					},
					{
						"name": "trust admins"
					}
				],
				"id": 739,
				"name": "cserpentis",
				"openid": "cserpentis.id.fedoraproject.org"
			},
			"user_id": 739
		},
		{
			"id": 632538,
			"text": "This update has reached 7 days in testing and can be pushed to stable now if the maintainer wishes",
			"timestamp": "2017-07-08 00:00:32",
			"update_id": 90685,
			"user": {
				"avatar": "https://apps.fedoraproject.org/img/icons/bodhi-24.png",
				"id": 91,
				"name": "bodhi",
				"openid": "bodhi.id.fedoraproject.org"
			},
			"user_id": 91
		},
		{
			"id": 632663,
			"text": "This update has been submitted for stable by myoung. ",
			"timestamp": "2017-07-08 18:41:54",
			"update_id": 90685,
			"user": {
				"avatar": "https://apps.fedoraproject.org/img/icons/bodhi-24.png",
				"id": 91,
				"name": "bodhi",
				"openid": "bodhi.id.fedoraproject.org"
			},
			"user_id": 91
		},
		{
			"id": 633839,
			"text": "This update has been pushed to stable.",
			"timestamp": "2017-07-12 03:24:48",
			"update_id": 90685,
			"user": {
				"avatar": "https://apps.fedoraproject.org/img/icons/bodhi-24.png",
				"id": 91,
				"name": "bodhi",
				"openid": "bodhi.id.fedoraproject.org"
			},
			"user_id": 91
		}
	],
	"content_type": "rpm",
	"critpath": true,
	"date_pushed": "2017-07-11 18:56:33",
	"date_stable": "2017-07-11 18:56:33",
	"date_submitted": "2017-06-22 22:56:50",
	"date_testing": "2017-06-23 20:56:17",
	"karma": 1,
	"meets_testing_requirements": true,
	"notes": "xen: various flaws (#1463247)\nblkif responses leak backend stack data [XSA-216]\npage transfer may allow PV guest to elevate privilege [XSA-217]\nRaces in the grant table unmap code [XSA-218]\nx86: insufficient reference counts during shadow emulation [XSA-219]\nx86: PKRU and BND* leakage between vCPU-s [XSA-220]\nstale P2M mappings due to insufficient error checking [XSA-222]\nARM guest disabling interrupt may crash Xen [XSA-223]\ngrant table operations mishandle reference counts [XSA-224]\narm: vgic: Out-of-bound access when sending SGIs [XSA-225]\nNULL pointer deref in event channel poll [XSA-221] (#1463231)",
	"pushed": true,
	"release": {
		"branch": "f25",
		"candidate_tag": "f25-updates-candidate",
		"composed_by_bodhi": true,
		"dist_tag": "f25",
		"id_prefix": "FEDORA",
		"long_name": "Fedora 25",
		"mail_template": "fedora_errata_template",
		"name": "F25",
		"override_tag": "f25-override",
		"package_manager": "dnf",
		"pending_signing_tag": "f25-signing-pending",
		"pending_stable_tag": "f25-updates-pending",
		"pending_testing_tag": "f25-updates-testing-pending",
		"stable_tag": "f25-updates",
		"state": "archived",
		"testing_repository": "updates-testing",
		"testing_tag": "f25-updates-testing",
		"version": "25"
	},
	"require_bugs": true,
	"require_testcases": true,
	"severity": "unspecified",
	"stable_karma": 3,
	"status": "stable",
	"suggest": "unspecified",
	"title": "xen-4.7.2-7.fc25",
	"type": "security",
	"url": "https://bodhi.fedoraproject.org/updates/FEDORA-2017-c3149b5fcb",
	"unstable_karma": -3,
	"updateid": "FEDORA-2017-c3149b5fcb",
	"user": {
		"avatar": "https://seccdn.libravatar.org/avatar/452c109725b44d08b366f9b865d80b0ed8e42a74addb73d34d139d0bdba27b63?s=24&d=retro",
		"email": "m.a.young@durham.ac.uk",
		"groups": [
			{
				"name": "packager"
			},
			{
				"name": "ipausers"
			},
			{
				"name": "fedora-contributor"
			},
			{
				"name": "signed_fpca"
			},
			{
				"name": "fedorabugs"
			}
		],
		"id": 129,
		"name": "myoung",
		"openid": "myoung.id.fedoraproject.org"
	},
	"version_hash": "620faf0098e5dcd8e4bcaf61d6b4bf66b75aeea7"
}
